{
   "version" : "https://jsonfeed.org/version/1.1",
   "title" : "Daring Fireball",
   "home_page_url" : "https://daringfireball.net/",
   "feed_url" : "https://daringfireball.net/feeds/json",
   "authors" : [
      {
         "url" : "https://twitter.com/gruber",
         "name" : "John Gruber"
      }
   ],
   "icon" : "https://daringfireball.net/graphics/apple-touch-icon.png",
   "favicon" : "https://daringfireball.net/graphics/favicon-64.png",
   "items" : [
      {
         "title" : "Sofa",
         "date_published" : "2022-07-16T23:44:40Z",
         "date_modified" : "2022-07-16T23:44:41Z",
         "id" : "https://daringfireball.net/linked/2022/07/16/sofa",
         "url" : "https://daringfireball.net/linked/2022/07/16/sofa",
         "external_url" : "https://itunes.apple.com/app/id1276554886",
         "authors" : [
            {
               "name" : "John Gruber"
            }
         ],
         "content_html" : "\n<p>My thanks to Sofa for sponsoring this week at DF. Sofa is a “productivity” app but it’s about being productive, and intentional, with your <em>downtime</em>. What do you do now when you hear about a new TV show, movie, book, or podcast you want to check out? You probably just throw it in your notes or to-do app with a zillion other types of things.</p>\n\n<p>Instead, throw it in Sofa. Sofa lets you create lists of apps, video games, books, movies, shows, podcasts — even board games. Whatever you want to watch, read, listen to, or play for fun. Adding new items is a cinch — Sofa has a smart search feature that auto-completes what you’re typing. I’ve been using Sofa for a few weeks now and the habit has stuck.</p>\n\n<p>Sofa is available for iPhone, iPad, and Apple silicon Macs. It has a really nice native UI. You can use it for free and it’s useful; the paid Super Sofa subscription makes it even better. Good support, good documentation, and a clever focused idea done well. <a href=\"https://itunes.apple.com/app/id1276554886\">Check it out today — it’s good</a>.</p>\n\n<p class=\"x-netnewswire-hide\" style=\"padding-top: 1.5em;\"><em>Link: <strong><a href=\"https://itunes.apple.com/app/id1276554886\">itunes.apple.com/app/id1276554886</a></strong></em></p>\n"
      },
      {
         "title" : "★ The 2022 13-Inch MacBook Air",
         "date_published" : "2022-07-16T03:59:00Z",
         "date_modified" : "2022-07-17T02:55:06Z",
         "id" : "https://daringfireball.net/2022/07/the_2022_13-inch_macbook_air",
         "url" : "https://daringfireball.net/2022/07/the_2022_13-inch_macbook_air",
         "authors" : [
            {
               "name" : "John Gruber"
            }
         ],
         "content_html" : "\n<p>The M2 MacBook Air marks the second generation of Apple silicon Macs. But it still seems hard for us, collectively, to wrap our heads around the sea change these chips have enabled. When I reviewed one of the first M1 Macs — a 13-inch MacBook Pro — back in November 2020, <a href=\"https://daringfireball.net/2020/11/the_m1_macs\">I wrote</a>:</p>\n\n<blockquote>\n  <p>Apple’s new Macs based on the M1 system on a chip, the first Macs\nbased on Apple silicon, are that sort of mind-bending <em>better</em>. To\nacknowledge how good they are — and I am here to tell you they\nare <em>astonishingly</em> good — you must acknowledge that certain\nlongstanding assumptions about how computers should be designed,\nabout what makes a better computer <em>better</em>, about what good\ncomputers <em>need</em>, are wrong.</p>\n\n<p>Some people will remain in denial about what Apple has\naccomplished here for years. That’s how it goes.</p>\n</blockquote>\n\n<p>I was right, but perhaps <em>denial</em> was the wrong word. Denial is often about refusing to believe something you don’t want to be true. With Apple silicon Macs, many people are hesitant to believe something they <em>want</em> to be true — that these computers are as good as they are. That they run very fast, very cool, and very efficiently. People suspect there has to be a catch.</p>\n\n<p>There is no catch.</p>\n\n<p>The 2020 M1 MacBook Air was (and <a href=\"https://www.apple.com/macbook-air-m1/\">remains</a>) a great laptop. The new M2 MacBook Air is clearly better in every regard.</p>\n\n<p>It’s thinner, lighter, faster, and has a better brighter display and better speakers. All while getting the same battery life and bringing MagSafe back, which effectively gives you an extra USB-C/Thunderbolt port while charging.</p>\n\n<p>The keyboard and trackpad are great. They both look and feel identical — or nearly so — to the keyboard and trackpad on the <a href=\"https://daringfireball.net/2021/10/the_2021_14-inch_macbook_pro\">2021 14- and 16-inch MacBook Pros with the M1 Pro and M1 Max chips</a>. With its flat, untapered top and bottom surfaces, the whole MacBook Air looks and feels like the thinner sibling to those new MacBook Pros.</p>\n\n<p>With the case closed, holding it, it is obviously thinner than the previous retina MacBook Airs. This has nothing to do with the previous MacBook Air models’ iconic wedge-shaped form, but instead is about the lack of subtle tapering on the new MacBook Air. That tapering had a slimming effect, but that effect was basically an <em>optical</em> trick. It made Intel MacBooks (and the first round of M1 MacBooks, which shared the same industrial designs) <em>look</em> thinner than they actually were or felt. This new design is more honest and feels great in hand. If there’s a downside to the new, untapered form factor, it’s that it makes these new MacBooks perhaps a bit harder to pick up from a table or desk using just one hand — without the tapering, it’s a bit harder to get one’s fingers underneath to lift it. But I say <em>perhaps</em>. It’s certainly not <em>hard</em> to pick up — and once in hand, it feels great.</p>\n\n<p>The camera is fine for a built-in laptop camera.</p>\n\n<p>There’s a notch. This looks weird at first, I know. But, as someone who’s been using a notched 14-inch MacBook Pro <a href=\"https://daringfireball.net/2021/10/the_2021_14-inch_macbook_pro\">for months</a>, trust me, you stop thinking about it after a few days. It’s a little bit weird when you use an app that has so many menus that one or more of them fall on the far side of the notch, but I don’t regularly use any apps with that many menus. I’ve got 26 apps running on this MacBook Air right now, and not one of them has too many menus to fit on the left of the notch.<sup id=\"fnr1-2022-07-15\"><a href=\"#fn1-2022-07-15\">1</a></sup></p>\n\n<p>The display is bright and sharp. Unlike the new MacBook Pros, there’s no HDR and no <a href=\"https://support.apple.com/guide/mac-help/change-displays-preferences-mchlca6faa13/12.0/mac/12.0\">ProMotion</a> (dynamic high refresh up to 120 Hz). The 14- and 16-inch MacBook Pro displays have a resolution of 254 pixels per inch; the MacBook Air’s display has a resolution of only 224 pixels per inch. The practical effect of this pixels-per-inch difference is that the default display resolution of the MacBook Pros is exactly 2×; on the Air, the default resolution uses scaling. You can configure the MacBook Air to use a display resolution that doesn’t use scaling, but that makes less content fit on screen. These display differences are a significant reason why the new MacBook Pros start at $2,000 and the new MacBook Air starts at just $1,200. It’s the difference between a truly exceptional display and a merely very good display.</p>\n\n<p>The MacBook Pros have much better speakers too, but the speakers on the new MacBook Air are good.</p>\n\n<p>Thermals are where people seem spooked. People are just so scarred from their experience with x86-based laptops (Apple’s or otherwise) over the last decade or so, as Intel lost the performance-per-watt plot, that they just can’t bring themselves to believe that a thin, high-performance, long-lasting, cool-running laptop with no fan (or, in Apple’s parlance, no “active cooling system”) is possible, let alone available at consumer-level prices. I’m here to reassure you: the new M2 MacBook Air is thin, high-performance, long-lasting, cool-running, and has no fan.</p>\n\n<p>Compared to the M1 MacBook Air, the M2 Air is a better-looking lighter-weight device outside and a faster computer inside. Not like radically game-changingly faster than the M1, but nicely faster — pretty much exactly what you’d like to see a little over a year and a half after the M1. Apple says it’s about about 10–20 percent faster. Benchmarks I ran peg it as ... about 10–20 percent faster. In the first two years of the Apple silicon era of Macs, the rest of the industry has not only failed to close the gap, they’ve fallen even further behind. The x86 Intel/AMD duopoly still has nothing that vaguely competes with the M1, and now Apple is shipping the M2 that’s even faster with the same or better energy efficiency.</p>\n\n<p>There’s not much more to say about it.</p>\n\n<p>Wait, there is one more thing. The hinge opens and closes <em>very</em> nicely. Apple’s MacBook hinge team does not get enough credit.</p>\n\n<hr />\n\n<p>The aforementioned “sounds too good to be true” incredulity is, I think, why the 13-inch M2 MacBook Pro exists. It’s why the M1 version of the 13-inch MacBook Pro sold well (second only to the MacBook Air) and why the new M2 version will continue to sell well. I expect it to remain the second-best selling Mac that Apple makes and yet, technically, it’s a machine almost no one should buy. But they do buy it, and like it, because they <em>think</em> they need it. It’s like people who think they want a big pickup truck or SUV yet never once use them for anything more than a smaller vehicle can handle. They just want it, because it <em>feels</em> like what they need, even though it isn’t in a practical sense.</p>\n\n<p>Basically, there are millions of people whose computing needs would be more than met by the MacBook Air but who <em>feel</em> like they probably need a slightly thicker laptop with a fan on the inside and the word “Pro” stamped on the outside<sup id=\"fnr2-2022-07-15\"><a href=\"#fn2-2022-07-15\">2</a></sup> because their current ostensibly pro-level laptop — which may well be a MacBook Pro from Apple with Intel inside — struggles under the load of their daily work. It runs hot, the fans scream, and the battery doesn’t last long enough. Switching to this new thinner fan-less MacBook Air from a thicker MacBook <em>Pro</em> that makes frequent, clearly audible, use of its fan <em>sounds</em> like a downgrade. But for the overwhelming majority of Intel-based MacBook Pro users, it’s not. Switching to the new M2 MacBook Air would be the biggest <em>upgrade</em> in their computing lives.</p>\n\n<p>I suspect this skepticism is exacerbated, even amongst somewhat technically-informed Mac users, by the fact that Apple tried to do this before with the <a href=\"https://support.apple.com/kb/sp757?locale=en_US\">12-inch no-adjective MacBook</a> and failed. A thin, lightweight design with no fans inside. That was the 12-inch MacBook — and the tradeoffs didn’t work out for a lot of people. It wasn’t noisy, because there was no fan, but because there was no fan it was slow. It started slow and throttled to run even slower to avoid getting hot. But the 12-inch MacBook wasn’t underpowered because a thin, fan-less, high-performance laptop was an impossible dream — it was underpowered because a thin, fan-less, high-performance laptop was and remains an impossible dream <em>for the x86 computing architecture</em>.</p>\n\n<p>The Apple silicon architecture is a different ballgame. Trying to convince someone who’s never actually lived with an M1 (or, now, M2) Mac just how much better the Apple silicon platform is than x86 is like trying to convince a time traveller from the 18th century how great indoor plumbing is. Words alone do not suffice. You really need to let them take a shit indoors on a nice warm toilet in the middle of a cold winter night and see for themselves.</p>\n\n<hr />\n\n<p>What is the ideal everyperson computer?</p>\n\n<p>Apple has been on a decades-long quest pursuing the answer to that question.</p>\n\n<p>The ideal everyperson computer is a laptop. That laptop has a full-sized keyboard and a beautiful 13-inch display. Maybe a 14-inch display with <em>really</em> small bezels. A smaller display is too small for most people’s taste (and may necessitate a slightly cramped keyboard); a larger display makes for too big and heavy a device for everyperson needs. The battery lasts all day despite active use and screen brightness being set to “plenty bright”. It has no fan because fan noise is abhorrent, but needs no fan because it’s equipped with chips that run more than fast enough without an active cooling system. The machine itself is physically durable and visually attractive. It has at least two high-speed modern I/O ports and a MagSafe port for charging. It doesn’t bother with legacy I/O ports, except, perhaps, a headphone jack, because that’s the only legacy port most people really will use. It only offers SSD storage. It runs just fine with the base amount of memory, but can be configured with up to two or three times more RAM, because more RAM is always better.<sup id=\"fnr3-2022-07-15\"><a href=\"#fn3-2022-07-15\">3</a></sup></p>\n\n<p>This new M2 MacBook Air is that machine.</p>\n\n<p>For the last decade-plus, the MacBook Air has been both the Mac that most people <em>do</em> buy, and the Mac that most people <em>should</em> buy. The M1 Pro/Max MacBook Pros introduced at the end of 2021 are the best MacBook Pros Apple has ever made, but with the M2 MacBook Air, it has never been more true that this is the Mac laptop the overwhelming majority of people <em>should</em> buy.</p>\n\n<p>The main difference most people will notice between the M2 MacBook Air and the 14-inch MacBook Pro is how much thinner and lighter the MacBook Air is. The new MacBook Air is so thin that its entire height, sitting on a desk (thus, including the feet), is almost identical to the height of the <em>bottom</em> of the MacBook Pro. Like, if you just snapped off the entire display of the MacBook Pro, that’s how thin the MacBook Air is. Here’s the M2 MacBook Air next to my 2021 14-inch MacBook Pro:</p>\n\n<p><a href=\"/misc/2022/07/2022-13-inch-macbook-air-2021-14-inch-macbook-pro.jpeg\" class=\"noborder\">\n  <img\n    src = \"/misc/2022/07/2022-13-inch-macbook-air-2021-14-inch-macbook-pro.jpeg\"\n    alt = \"A starlight-colored 2022 M2 MacBook Air next to a space gray 2021 14-inch MacBook Pro, both with their lids closed.\"\n    width = 500\n  /></a></p>\n\n<p>The <em>last</em> difference most people will notice between the MacBook Air and MacBook Pro is that MacBook Pro has an active cooling system and the MacBook Air does not. They’ll never miss not having a fan in the Air and would never engage or notice the fan if they were instead using the Pro. If you doubt this, I beseech you, give indoor plumbing a chance.</p>\n\n<p>I own a 2021 14-inch MacBook Pro. I’ve been using this 13-inch M2 MacBook Air all week, and because I started by cloning my personal machine using Migration Assistant,<sup id=\"fnr4-2022-07-15\"><a href=\"#fn4-2022-07-15\">4</a></sup> I’ve been confused at times which machine I was using at the moment. I find myself thinking, “<em>Hey, I should be using the MacBook Air, I have a review to write</em>” and then I look down and I <em>am</em> using the M2 MacBook Air. My review unit Air is starlight colored, with 1 TB storage and 16 GB RAM. My personal MacBook Pro is space gray, maxed out (no pun intended) with a 4 TB SSD and 64 GB RAM. In my daily use, this $1,900 MacBook Air feels identical to my $4,700 MacBook Pro.</p>\n\n<hr />\n\n<p>What could be better on the Air?</p>\n\n<p>In theory it could be even thinner and lighter. We’ll have to wait for future silicon for that to be possible without compromising performance or battery life. But such is <a href=\"https://oldcomputers.net/macportable.html\">the march of progress</a>.</p>\n\n<p>It’d be nice if the MacBook Air’s M2 chip <a href=\"https://www.apple.com/macbook-air-m2/specs/\">could drive more than one external display</a>. (<a href=\"https://www.apple.com/macbook-pro-14-and-16/specs/\">The M1 Pro chip can drive up to three; the M1 Max up to four</a>.) Instead of putting both Thunderbolt/USB-C ports on the left, it’d be nice if one of them were on the right.</p>\n\n<p>As mentioned above, it’d be nice if the MacBook Air display’s physical resolution were higher, so that the default <em>effective</em> resolution wouldn’t require scaling.</p>\n\n<p>There are several minor downsides particular to the entry model — the $1,200 configuration with 256 GB of storage. That base model has an 8-core GPU instead of 10-core, the result of <a href=\"https://en.wikipedia.org/wiki/Product_binning\">chip binning</a>. It costs $100 more to upgrade to a 10-core GPU. So far so good — for price-sensitive buyers, being able to trade 2 GPU cores for $100 seems fair. It feels like a cheapskate move, though, that the base model ships with the old 30-watt power adapter with a single USB-C port — all the other MacBook Air configurations include the new 35-watt power adapter with two USB-C ports, enabling you to charge two devices at once. Base model buyers can upgrade to this 35-watt charger for $20 (<a href=\"https://www.apple.com/shop/product/MNWM3AM/A/35w-dual-usb-c-port-compact-power-adapter\">it costs $59 on its own</a>), but a $1,200 MacBook Air should include that new charger by default. Apple even took time during the WWDC keynote to show this dual charger off. Lastly, there’s <a href=\"https://www.macrumors.com/2022/07/14/m2-macbook-air-slower-ssd-base-model/\">the kerfuffle over the fact that SSD read and write performance is slower with the 256 GB configuration</a>, because it uses just a single NAND chip, whereas all other storage configurations use multiple NAND chips. It costs $200 to upgrade the base model to 512 GB storage. None of these are dealbreakers to me, just minor details to be aware of if you’re eying the $1,200 base model. It’s best, in my opinion, to consider the $1,500 configuration as the default model (10 GPUs, full-speed SSD performance, and the new 35-watt charger), and to consider the $1,200 configuration something more like the “discount” configuration.</p>\n\n<p>I still miss the illuminated Apple logo on older MacBooks — it’d be nice if Apple could figure out a way to bring that back.</p>\n\n<p>Otherwise, I’m grasping for straws here looking for anything that could reasonably be significantly improved, to be honest. The M2 MacBook Air is that close to ideal for what it’s meant to be.<sup id=\"fnr5-2022-07-15\"><a href=\"#fn5-2022-07-15\">5</a></sup></p>\n\n<hr />\n\n<p>After the M1 iMacs shipped a year ago in <a href=\"https://www.apple.com/newsroom/2021/04/imac-features-all-new-design-in-vibrant-colors-m1-chip-and-45k-retina-display/\">an array of fun vibrant colors</a>, the biggest surprise last month when Apple introduced the new MacBook Air is that it didn’t come in <em>any</em> fun vibrant colors. As mentioned above, my review unit is starlight. Starlight, to my eyes, is nice, but it’s subtle. It’s definitely well-named — it should not be called gold or “<em>some adjective</em> gold”. It’s more like silver with a warmer color temperature. Noticeably different from actual silver, but also not too far from neutral. The new midnight color is the darkest MacBook Apple has ever made from aluminum. I haven’t seen one in person since WWDC, but it looked really nice. But part of why I, personally, liked it so much is that it appeared only subtly blue — more like very dark gray with a hint of blue than “dark blue”. The new MacBook Air color choices are all rather conservative.</p>\n\n<p>Many people <em>say</em> they wish the new MacBook Air came in colors like those of the iMac, or iPhones and iPads. And, at WWDC, it was a very common question members of the media asked representatives from Apple: why not offer the Air in colors like the iMac? As ever with Apple, they did not really explain themselves. But reading between the lines and consulting my Cupertino-ology translation handbook, the gist I took away from their non-answer answers was that vibrant-colored laptops don’t actually look good in use. One might think they would, but they don’t. I’m not saying that’s true — I’m saying that’s what I think Apple product marketing folks were trying to say without actually saying it. (Apple product marketing reps only like to talk about what Apple <em>has</em> done, not what Apple <em>could</em> have done differently.) If you think about it, though, this makes some sense. Laptops are unique. Note, for one thing, that iPhones and iPads have displays that take up their entire front faces. You can have a bright red iPhone or a very blue iPad but while you’re <em>using</em> it, you don’t really see the red or blue (or purple or pink or green or whatever) casing. And even with the M1 iMacs, the vibrant aluminum is all on the back — the chins are much more neutral. Not so with a MacBook, where the unibody aluminum is fully exposed when the laptop is open. When you’re using a laptop, you want the visual emphasis entirely on the display. Vibrant aluminum colors don’t distract from an all-display iPhone or iPad while in use; they might with a laptop. Again, I’m not saying I know that’s true, because I’ve never used a (say) Product Red MacBook — I’m just saying that seems to be what Apple folks were telling us, in so many words, and it does seem plausible.</p>\n\n<p>That said, it’s worth considering that the teardrop MacBook Air form factor was with us for 14 years. This all-new MacBook Air design might be with us for a similarly long stretch. One way Apple can keep this basic design fresh year after year is by introducing new colorways. That’s what Apple does with the iPhone and iPad — form factors change only rarely, but color options change every year. I expect we’ll see MacBook Air colorways that are more fun eventually.</p>\n\n<p>The biggest (and smallest) room for improvement with the new MacBook Air would be options for larger and smaller displays. If you want a large-screen MacBook — 15 or 16 inches — your only option is the 16-inch MacBook Pro, which <em>starts</em> at $2,500. That’s downright absurd given that the M2 MacBook Air has the performance and features necessary to serve as the primary Mac for the overwhelming majority of even serious Mac users. The 16-inch MacBook Pro costs $500 more than the correspondingly-specced 14-inch MacBook Pro. There should be a 15-inch MacBook Air that costs $400 or $500 more than the correspondingly-specced 13-inch Air.</p>\n\n<p>Apple has never made such a big-screen non-Pro MacBook, but they should. But Apple <em>has</em> made smaller laptops before, and they should again. From 2010 through 2017, Apple made an 11-inch MacBook Air. It was one of my favorite Macs ever made. From 2015 through 2019, Apple made the 12-inch retina MacBook, which was particularly notable at the time because the MacBook Air didn’t yet have a retina display. Thin and light though the new M2 MacBook Air is, at 13 inches, it is noticeably heavier than either of those discontinued models:<sup id=\"fnr6-2022-07-15\"><a href=\"#fn6-2022-07-15\">6</a></sup></p>\n\n<!-- Markdown Table\n|                                                                | Weight             | Thickness (max) |\n| -------------------------------------------------------------- | :----------------: | :-------------: |\n| [2022 13-inch MacBook Air](https://support.apple.com/kb/SP869) | 2.70 lbs / 1.24 kg | 1.13 cm         |\n| [2015 11-inch MacBook Air](https://support.apple.com/kb/SP713) | 2.38 lbs / 1.08 kg | 1.70 cm         |\n| [2017 12-inch MacBook](https://support.apple.com/kb/SP757)     | 2.03 lbs / 0.92 kg | 1.31 cm         |\n-->\n\n<table style = \"width: 475px; margin-left: -0px;\">\n<thead>\n<tr>\n  <th></th>\n  <th align=\"center\">Weight</th>\n  <th align=\"center\">Thickness (max)</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n  <td><a href=\"https://support.apple.com/kb/SP869\">2022 13-inch MacBook Air</a></td>\n  <td align=\"center\">2.70 lbs / 1.24 kg</td>\n  <td align=\"center\">1.13 cm</td>\n</tr>\n<tr>\n  <td><a href=\"https://support.apple.com/kb/SP713\">2015 11-inch MacBook Air</a></td>\n  <td align=\"center\">2.38 lbs / 1.08 kg</td>\n  <td align=\"center\">1.70 cm</td>\n</tr>\n<tr>\n  <td><a href=\"https://support.apple.com/kb/SP757\">2017 12-inch MacBook</a></td>\n  <td align=\"center\">2.03 lbs / 0.92 kg</td>\n  <td align=\"center\">1.31 cm</td>\n</tr>\n</tbody>\n</table>\n\n<p>Wishing that Apple made 11- and 15-inch models is a fair criticism of the company, but it’s not a fair criticism of this device, of course. And if there’s only going to be one size, this, clearly, is it. I am convinced that many people would prefer a larger or smaller MacBook Air, but I am even more convinced that <em>most</em> people are best served by this mid-range size. Some people do like their porridge cool or piping hot, but 13 inches is the Goldilocks “just right” size.</p>\n\n<hr />\n\n<p>The M2 13-inch MacBook Air should not be thought of as version 2 of an Apple silicon MacBook Air. It’s more like version — I don’t know — <em>40</em> of what Apple thinks a standard Mac laptop should be. Apple silicon is what’s been missing — no-compromise chips that enable Apple to make the laptops they’ve always wanted to make. It’s taken decades of iterative refinement to get to this point: a nearly perfect laptop for nearly everyone.</p>\n\n<div class=\"footnotes\">\n<hr />\n<ol>\n\n<li id=\"fn1-2022-07-15\">\n<p>BBEdit and Safari come the closest among my currently-running apps. Safari, because I have both its optional <a href=\"https://support.apple.com/guide/safari/use-the-developer-tools-in-the-develop-menu-sfri20948/mac\">Develop</a> and <a href=\"https://sixcolors.com/post/2020/09/enabling-the-debug-menu-in-safari-14-on-big-sur-and-catalina/\">Debug</a> menus enabled. One app I occasionally use that <em>does</em> have menus that span the notch gap is Safari Technology Preview — because the name of the app itself in the menu bar takes up so much space.&nbsp;<a href=\"#fnr1-2022-07-15\"  class=\"footnoteBackLink\"  title=\"Jump back to footnote 1 in the text.\">&#x21A9;&#xFE0E;</a></p>\n</li>\n\n<li id=\"fn2-2022-07-15\">\n<p>Here’s a weird detail about the new MacBook Air: it doesn’t say “MacBook Air” (or even “MacBook”) anywhere on the case. The new 2021 MacBook Pros have “MacBook Pro” <a href=\"https://daringfireball.net/misc/2021/10/macbook-pro-engraving.jpeg\">nicely embossed in the aluminum on the case bottom</a>. The old M1 MacBook Air <a href=\"https://daringfireball.net/misc/2022/07/m1-macbook-air-name-under-display.jpeg\">has “MacBook Air” printed (somewhat obnoxiously, in my opinion) in white on the black bezel</a> underneath the display. But the new M2 MacBook Air is just completely unlabeled but for the mirror-polished Apple logo on the top of the case.&nbsp;<a href=\"#fnr2-2022-07-15\"  class=\"footnoteBackLink\"  title=\"Jump back to footnote 2 in the text.\">&#x21A9;&#xFE0E;︎</a></p>\n</li>\n\n\n<li id=\"fn3-2022-07-15\">\n<p>Seymour Cray’s famous quip regarding swap: “Memory is like an orgasm. It’s a lot better if you don’t have to fake it.”&nbsp;<a href=\"#fnr3-2022-07-15\"  class=\"footnoteBackLink\"  title=\"Jump back to footnote 3 in the text.\">&#x21A9;&#xFE0E;︎</a></p>\n</li>\n\n<li id=\"fn4-2022-07-15\">\n<p>I will repeat here <a href=\"https://daringfireball.net/2020/11/the_m1_macs#fn2-2020-11-17\">a footnote from my review of the first M1 MacBook Pro back in November 2020</a>: Migration Assistant is simply an astonishingly good tool. If you religiously set up all new Macs from scratch, I implore you to give it a shot. If you don’t like it you can always start over from scratch. Seriously, you’re missing out if you don’t use it.&nbsp;<a href=\"#fnr4-2022-07-15\"  class=\"footnoteBackLink\"  title=\"Jump back to footnote 4 in the text.\">&#x21A9;&#xFE0E;︎</a></p>\n</li>\n\n<li id=\"fn5-2022-07-15\">\n<p>Here’s a gripe. The keys on Apple’s modern keyboards all develop a shine over time, starting with the most-used keys. It looks like oil from your skin, but it’s not — you can’t clean it off. It’s erosion of the plastic. <a href=\"https://www.daskeyboard.com/blog/pbt-keycaps-vs-abs-keycaps-which-is-better/\">Long story short</a>, ABS plastic is more commonly used on keycaps because it’s cheaper; PBT plastic is more expensive. ABS plastic keycaps develop a shine the more they’re used; PBT keycaps do not. Apple has solved this problem before — the Extended Keyboard II I use at my desk was manufactured in the 20th century but the one and only key with any shine to it <a href=\"https://www.flickr.com/photos/gruber/2452375091/in/album-72157604797968156/\">is the space bar</a>. They should solve it again.</p>\n\n<p>To be clear, I have no idea what kind of plastic Apple uses for its keycaps. I’m just saying that it’s well known that cheaping out on the materials used to produce keycaps results in keys that get shiny over time. Apple is a company that prides itself on its materials engineering and the durability of its products, and so they could fix this if they cared. And they should care.&nbsp;<a href=\"#fnr5-2022-07-15\"  class=\"footnoteBackLink\"  title=\"Jump back to footnote 5 in the text.\">&#x21A9;&#xFE0E;︎</a></p>\n</li>\n\n<li id=\"fn6-2022-07-15\">\n<p>For what it’s worth, the M2 13-inch MacBook Air is significantly thinner and lighter (1.24 kg vs. 1.40 kg) than the 12.9-inch iPad Pro attached to a Magic Keyboard. Magic Keyboards are nice peripherals, but they make for a somewhat chunky whole compared to a true laptop.&nbsp;<a href=\"#fnr6-2022-07-15\"  class=\"footnoteBackLink\"  title=\"Jump back to footnote 6 in the text.\">&#x21A9;&#xFE0E;︎</a></p>\n</li>\n\n</ol>\n</div>\n\n\n\n    "
      },
      {
         "title" : "NYT: Consulting Agreement Ends Between Apple and Jony Ive’s LoveFrom",
         "date_published" : "2022-07-13T01:48:05Z",
         "date_modified" : "2022-07-14T01:37:43Z",
         "id" : "https://daringfireball.net/linked/2022/07/12/nyt-jony-ive-apple",
         "url" : "https://daringfireball.net/linked/2022/07/12/nyt-jony-ive-apple",
         "external_url" : "https://www.nytimes.com/2022/07/12/technology/apple-jony-ive-end-agreement.html",
         "authors" : [
            {
               "name" : "John Gruber"
            }
         ],
         "content_html" : "\n<p>Tripp Mickle, with a scoop for The New York Times:</p>\n\n<blockquote>\n  <p>Mr. Ive and Apple have agreed to stop working together, according\nto two people with knowledge of their contractual agreement,\nending a three-decade run during which the designer helped define\nevery rounded corner of an iPhone and guided development of its\nonly new product category in recent years, the Apple Watch.</p>\n\n<p>When Mr. Ive left Apple in 2019 to start his own design firm,\nLoveFrom, the iPhone maker signed a multiyear contract with him\nvalued at more than $100 million. That made Apple his firm’s\nprimary client, people with knowledge of the agreement said.</p>\n\n<p>The deal restricted Mr. Ive from taking on work that Apple found\ncompetitive and ensured that the designer would inform the\ndevelopment of future products, such as an augmented-reality\nheadset that it is expected to ship next year, the people said.</p>\n\n<p>In recent weeks, with the contract coming up for renewal, the\nparties agreed not to extend it. Some Apple executives had\nquestioned how much the company was paying Mr. Ive and had grown\nfrustrated after several of its designers left to join Mr. Ive’s\nfirm. And Mr. Ive wanted the freedom to take on clients without\nneeding Apple’s clearance, these people said.</p>\n</blockquote>\n\n<p>It remains unclear (to me at least) how much Ive (and LoveFrom) have been involved with Apple over the last three years, so it’s unclear whether the lapsing of this formal consulting agreement is largely symbolic, or if it marks a true parting of the ways.</p>\n\n<p><strong>Update:</strong> I’m hearing, from a few sources, that LoveFrom’s involvement with Apple has been <em>more</em> than symbolic over the past three years — which makes sense! — and that Apple folks have been reviewing new product designs with Ive as recently as a few months ago. This story in The New York Times is the first a lot of people inside Apple have heard about the purported breakup.</p>\n\n<p><strong>Update 2:</strong> <a href=\"https://twitter.com/cabel/status/1547246296238415873\">A better question</a>: Which side leaked this to Mickle? I’m thinking it was someone at Apple, not LoveFrom. The begrudgingness regarding LoveFrom’s high consulting fees certainly makes it sound like the leak came from Apple. Not a strategic leak, necessarily, but perhaps just someone at Apple who has Mickle’s ear. Strategically, I think Apple would have preferred to let the dissolution of this partnership go unnoticed. But it’s an interesting question.</p>\n\n<p class=\"x-netnewswire-hide\" style=\"padding-top: 1.5em;\"><em>Link: <strong><a href=\"https://www.nytimes.com/2022/07/12/technology/apple-jony-ive-end-agreement.html\">nytimes.com/2022/07/12/technology/apple-jony-ive-end…</a></strong></em></p>\n"
      },
      {
         "title" : "First Images From NASA’s James Webb Space Telescope",
         "date_published" : "2022-07-12T17:30:52Z",
         "date_modified" : "2022-07-12T17:35:35Z",
         "id" : "https://daringfireball.net/linked/2022/07/12/james-webb-first-images",
         "url" : "https://daringfireball.net/linked/2022/07/12/james-webb-first-images",
         "external_url" : "https://www.nasa.gov/webbfirstimages",
         "authors" : [
            {
               "name" : "John Gruber"
            }
         ],
         "content_html" : "\n<p>It’s always exciting to see new images like these, but a win for science feels especially good right now. <a href=\"https://twitter.com/RichardDawkins/status/1546779835233492992\">Richard Dawkins</a>:</p>\n\n<blockquote>\n  <p>Looking back, science extends our vision to the origin of time itself. Looking forward, science offers us our only hope that we’ll have a forward to look to.</p>\n</blockquote>\n\n<p class=\"x-netnewswire-hide\" style=\"padding-top: 1.5em;\"><em>Link: <strong><a href=\"https://www.nasa.gov/webbfirstimages\">nasa.gov/webbfirstimages</a></strong></em></p>\n"
      },
      {
         "title" : "The One Good Thing About the Elon Musk Twitter Acquisition Saga: Matt Levine’s Coverage",
         "date_published" : "2022-07-12T16:00:11Z",
         "date_modified" : "2022-07-12T16:14:11Z",
         "id" : "https://daringfireball.net/linked/2022/07/12/musk-twitter-levine",
         "url" : "https://daringfireball.net/linked/2022/07/12/musk-twitter-levine",
         "external_url" : "https://www.bloomberg.com/opinion/articles/2022-07-09/elon-s-out",
         "authors" : [
            {
               "name" : "John Gruber"
            }
         ],
         "content_html" : "\n<p>Matt Levine:</p>\n\n<blockquote>\n  <p>So this April, Musk <a href=\"https://www.sec.gov/Archives/edgar/data/0001418091/000110465922045641/tm2212748d1_sc13da.htm\">announced</a> that he wanted to buy Twitter Inc. Why not? Musk seems to <a href=\"https://www.bloomberg.com/opinion/articles/2022-04-04/elon-musk-bought-some-twitter?sref=1kJVNqnU\">get a lot of joy out of using Twitter</a>, and pretending to buy Twitter is a good way to create drama <em>on Twitter</em>. At the time, I assumed that, as with Tesla, he was doing a bit. “Ordinarily,” <a href=\"https://www.bloomberg.com/opinion/articles/2022-04-15/sure-elon-musk-might-buy-twitter?sref=1kJVNqnU\">I wrote</a>, “if a billionaire chief executive officer of a public company offers to buy a company, the odds that he is <em>kidding</em> are quite low. When it’s Elon Musk, the historical odds are, like, 50/50.” </p>\n\n<p>But he surprised me by quickly <a href=\"https://www.bloomberg.com/opinion/articles/2022-04-21/elon-got-his-money?sref=1kJVNqnU\">lining up financing</a> (paying millions of dollars of fees to banks for commitment letters) and <a href=\"https://www.bloomberg.com/opinion/articles/2022-04-26/elon-got-his-deal?sref=1kJVNqnU\">signing a merger agreement with Twitter</a>. If he <em>was</em> pretending he was going to buy Twitter, those were pretty elaborate lengths to go to? But he frequently goes to elaborate (and expensive) lengths for a joke — he sold 20,000 <a href=\"https://www.boringcompany.com/not-a-flamethrower\">branded flamethrowers</a> to make a joke about flamethrowers, and also founded <a href=\"https://www.boringcompany.com/\">Boring Co.</a> to make a joke (???) about tunnels — so who knows. Would he line up billions of dollars of financing and sign a binding merger agreement with a specific-performance clause and a $1 billion breakup fee as a joke? I mean! Nobody else would! But he might! [...]</p>\n\n<p>Still, one should remain open to the possibility that he <em>was</em> kidding when he first signed the deal. “Elon Musk had a well-thought-out business and financial plan for Twitter that worked in the economic conditions of early April 2022, but conditions have changed and the model no longer works” does not strike me as the most plausible description of what is going on here. “Elon Musk whimsically thought it might be fun to own Twitter, so he signed a merger agreement without taking it too seriously and then lost interest a week later” feels more true to the situation. My first reaction to his proposal to buy Twitter, that it was a joke, may have been the correct one. He was just a lot more committed to the bit than I expected.</p>\n</blockquote>\n\n<p>I am so tired of this whole bizarre saga but I seemingly will never tire of Levine’s entertaining and insightful coverage of it. Here’s just one interesting thought from a column full of them:</p>\n\n<blockquote>\n  <p>The fact that Musk is working in such bad faith here — that he seems so unconcerned with law and the contract he signed — <a href=\"https://www.bloomberg.com/opinion/articles/2022-05-17/elon-musk-does-not-care-about-spam-bots?sref=1kJVNqnU#footnote-1\">cuts both ways</a>. On the one hand, it will certainly annoy a Delaware chancellor; Delaware likes to think of itself as a stable place for corporate deals, with predictable law and binding contracts, and Musk’s antics undermine that. On the other hand it might <em>intimidate</em> a Delaware chancellor: What if the court orders Musk to close the deal and he says no? They’re not gonna put him in Chancery jail. The guy is <a href=\"https://www.bloomberg.com/opinion/articles/2019-02-26/elon-musk-keeps-tweeting?sref=1kJVNqnU\">pretty contemptuous</a> of legal authority; he thinks he is above the law and <a href=\"https://www.bloomberg.com/opinion/articles/2022-05-13/elon-musk-trolls-twitter?sref=1kJVNqnU\">he might be right</a>. A showdown between Musk and a judge might undermine Delaware corporate law more than letting him weasel out of the deal would.</p>\n</blockquote>\n\n<p class=\"x-netnewswire-hide\" style=\"padding-top: 1.5em;\"><em>Link: <strong><a href=\"https://www.bloomberg.com/opinion/articles/2022-07-09/elon-s-out\">bloomberg.com/opinion/articles/2022-07-09/elon-s-out</a></strong></em></p>\n"
      },
      {
         "title" : "New ‘Lockdown Mode’ Coming to iOS 16 and MacOS 13 Ventura",
         "date_published" : "2022-07-11T22:50:06Z",
         "date_modified" : "2022-07-11T23:02:35Z",
         "id" : "https://daringfireball.net/linked/2022/07/11/lockdown-mode",
         "url" : "https://daringfireball.net/linked/2022/07/11/lockdown-mode",
         "external_url" : "https://www.apple.com/newsroom/2022/07/apple-expands-commitment-to-protect-users-from-mercenary-spyware/",
         "authors" : [
            {
               "name" : "John Gruber"
            }
         ],
         "content_html" : "\n<p>Apple, last week:</p>\n\n<blockquote>\n  <p>Apple today detailed two initiatives to help protect users who may\nbe personally targeted by some of the most sophisticated digital\nthreats, such as those from private companies developing\nstate-sponsored mercenary spyware. Lockdown Mode — the first\nmajor capability of its kind, coming this fall with iOS 16, iPadOS\n16, and macOS Ventura — is an extreme, optional protection for\nthe very small number of users who face grave, targeted threats to\ntheir digital security. Apple also shared details about the $10\nmillion cybersecurity grant it announced last November to support\ncivil society organizations that conduct mercenary spyware threat\nresearch and advocacy. [...]</p>\n\n<p>At launch, Lockdown Mode includes the following protections:</p>\n\n<ul>\n<li><p>Messages: Most message attachment types other than images are\nblocked. Some features, like link previews, are disabled.</p></li>\n<li><p>Web browsing: Certain complex web technologies, like\njust-in-time (JIT) JavaScript compilation, are disabled unless\nthe user excludes a trusted site from Lockdown Mode.</p></li>\n<li><p>Apple services: Incoming invitations and service requests,\nincluding FaceTime calls, are blocked if the user has not\npreviously sent the initiator a call or request.</p></li>\n<li><p>Wired connections with a computer or accessory are blocked when\niPhone is locked.</p></li>\n<li><p>Configuration profiles cannot be installed, and the device\ncannot enroll into mobile device management (MDM), while\nLockdown Mode is turned on.</p></li>\n</ul>\n</blockquote>\n\n<p>Interesting list of features that will be restricted — this almost certainly maps directly to the known sources of vulnerabilities that have been exploited by NSO Group and <a href=\"https://daringfireball.net/linked/2018/04/16/graykey-unlocker\">Grayshift’s GrayLock device</a>. Good to see Apple increasing its bounties for vulnerabilities reported in these areas, and the $10 million grant as well.</p>\n\n<p class=\"x-netnewswire-hide\" style=\"padding-top: 1.5em;\"><em>Link: <strong><a href=\"https://www.apple.com/newsroom/2022/07/apple-expands-commitment-to-protect-users-from-mercenary-spyware/\">apple.com/newsroom/2022/07/apple-expands-commitment-to…</a></strong></em></p>\n"
      },
      {
         "title" : "Tailscale",
         "date_published" : "2022-07-11T19:49:51Z",
         "date_modified" : "2022-07-11T19:49:52Z",
         "id" : "https://daringfireball.net/linked/2022/07/11/tailscale",
         "url" : "https://daringfireball.net/linked/2022/07/11/tailscale",
         "external_url" : "https://tailscale.com/tailscale-ssh/?utm_source=df&utm_medium=RSS",
         "authors" : [
            {
               "name" : "John Gruber"
            }
         ],
         "content_html" : "\n<p>My thanks to Tailscale for sponsoring last week — and the previous two weeks — at DF. Tailscale offers remarkably good ways to manage SSH connections. No more bastions. No more juggling keys. It’s SSH that just works.</p>\n\n<p>Tailscale is completely free for personal use on up to 20 devices, and remarkably affordable for use on teams both small and large.</p>\n\n<p class=\"x-netnewswire-hide\" style=\"padding-top: 1.5em;\"><em>Link: <strong><a href=\"https://tailscale.com/tailscale-ssh/?utm_source=df&utm_medium=RSS\">tailscale.com/tailscale-ssh/?utm_source=df&utm_medium=RSS</a></strong></em></p>\n"
      },
      {
         "title" : "[Sponsor] Sofa",
         "date_published" : "2022-07-11T19:03:23-05:00",
         "date_modified" : "2022-07-16T22:54:08-05:00",
         "id" : "https://daringfireball.net/feeds/sponsors/2022/07/sofa",
         "url" : "https://daringfireball.net/feeds/sponsors/2022/07/sofa",
         "external_url" : "https://itunes.apple.com/app/id1276554886",
         "authors" : [
            {
               "name" : "Daring Fireball Department of Commerce"
            }
         ],
         "content_html" : "\n<p>Sofa is an app that helps you be more productive, but in a slightly different way. It focuses on being more intentional with your downtime.</p>\n\n<p>Imagine you hear about a great new tv show, book, or podcast. What would you do? You’d probably scribble it down in your notes or to-do app never to be seen again.</p>\n\n<p>Instead, throw it in Sofa.</p>\n\n<p>Create lists of apps, books, board games, movies, tv shows, podcasts, music albums, and video games to enjoy later.</p>\n\n<p>Sofa is available for iPhone, iPad, and Apple silicon Macs. <a href=\"https://itunes.apple.com/app/id1276554886\">Start organizing your downtime for free today</a>.</p>\n\n<p class=\"x-netnewswire-hide\" style=\"padding-top: 1.5em;\"><em>Link: <strong><a href=\"https://itunes.apple.com/app/id1276554886\">itunes.apple.com/app/id1276554886</a></strong></em></p>\n"
      },
      {
         "title" : "What Happened to Michael Flynn?",
         "date_published" : "2022-07-08T22:14:40Z",
         "date_modified" : "2022-07-08T22:20:30Z",
         "id" : "https://daringfireball.net/linked/2022/07/08/flynn-nutjob",
         "url" : "https://daringfireball.net/linked/2022/07/08/flynn-nutjob",
         "external_url" : "https://www.theatlantic.com/ideas/archive/2022/07/michael-flynn-conspiracy-theories-january-6-trump/661439/",
         "authors" : [
            {
               "name" : "John Gruber"
            }
         ],
         "content_html" : "\n<p>Barton Gellman, writing for The Atlantic:</p>\n\n<blockquote>\n  <p>He has baffled old comrades with his transformation since being fired as director of the Defense Intelligence Agency in 2014. He led chants to lock up Hillary Clinton in 2016. In 2020, he posted a video of himself taking an oath associated with QAnon. He has endorsed crackpot fabrications of the extreme right: that Italy used military satellites to switch votes from Trump to Biden in 2020, that COVID-19 was a hoax perpetrated by a malevolent global elite, that the vaccine infused recipients with microchips designed for mind control.</p>\n\n<p>Has Flynn always been susceptible to paranoid conspiracies? Or did something happen along the way that fundamentally shifted his relationship to reality? In recent conversations I had with the former general’s close associates, some for attribution and some not, they offered a variety of theories.</p>\n</blockquote>\n\n<p>Sort of like a variant of <a href=\"https://en.wikipedia.org/wiki/Peter_principle\">the Peter Principle</a>, but instead of rising to a level of incompetence, Flynn rose to a level of insanity.</p>\n\n<p class=\"x-netnewswire-hide\" style=\"padding-top: 1.5em;\"><em>Link: <strong><a href=\"https://www.theatlantic.com/ideas/archive/2022/07/michael-flynn-conspiracy-theories-january-6-trump/661439/\">theatlantic.com/ideas/archive/2022/07/michael-flynn…</a></strong></em></p>\n"
      },
      {
         "title" : "Elon Musk Walks Away From Twitter Deal",
         "date_published" : "2022-07-08T21:46:39Z",
         "date_modified" : "2022-07-08T21:47:19Z",
         "id" : "https://daringfireball.net/linked/2022/07/08/musk-twitter-walk-away",
         "url" : "https://daringfireball.net/linked/2022/07/08/musk-twitter-walk-away",
         "external_url" : "https://www.axios.com/2022/07/08/elon-musk-twitter-deal-terminating",
         "authors" : [
            {
               "name" : "John Gruber"
            }
         ],
         "content_html" : "\n<p>Shocker.</p>\n\n<p class=\"x-netnewswire-hide\" style=\"padding-top: 1.5em;\"><em>Link: <strong><a href=\"https://www.axios.com/2022/07/08/elon-musk-twitter-deal-terminating\">axios.com/2022/07/08/elon-musk-twitter-deal-terminating</a></strong></em></p>\n"
      },
      {
         "title" : "New MacBook Air With M2 Available to Order Starting This Friday",
         "date_published" : "2022-07-06T17:18:08Z",
         "date_modified" : "2022-07-06T17:21:35Z",
         "id" : "https://daringfireball.net/linked/2022/07/06/m2-macbook-air-orders",
         "url" : "https://daringfireball.net/linked/2022/07/06/m2-macbook-air-orders",
         "external_url" : "https://www.apple.com/newsroom/2022/07/all-new-macbook-air-with-m2-available-to-order-starting-friday-july-8/",
         "authors" : [
            {
               "name" : "John Gruber"
            }
         ],
         "content_html" : "\n<p>If you plan to order one, set your alarm for 5am PDT / 8am EDT — my spidey-sense says a <em>lot</em> of people have been waiting for this Mac.</p>\n\n<p class=\"x-netnewswire-hide\" style=\"padding-top: 1.5em;\"><em>Link: <strong><a href=\"https://www.apple.com/newsroom/2022/07/all-new-macbook-air-with-m2-available-to-order-starting-friday-july-8/\">apple.com/newsroom/2022/07/all-new-macbook-air-with-m2…</a></strong></em></p>\n"
      },
      {
         "title" : "Bun",
         "date_published" : "2022-07-06T14:02:19Z",
         "date_modified" : "2022-07-06T14:04:07Z",
         "id" : "https://daringfireball.net/linked/2022/07/06/bun",
         "url" : "https://daringfireball.net/linked/2022/07/06/bun",
         "external_url" : "https://bun.sh/",
         "authors" : [
            {
               "name" : "John Gruber"
            }
         ],
         "content_html" : "\n<p>Sounds like a project we’ll be hearing a lot more about:</p>\n\n<blockquote>\n  <p>Bun is a modern JavaScript runtime like Node or Deno. It was built from scratch to focus on three main things:</p>\n\n<p>Start fast (it has the edge in mind).</p>\n\n<p>New levels of performance (extending JavaScriptCore, the engine).</p>\n\n<p>Being a great and complete tool (bundler, transpiler, package manager).</p>\n\n<p>[…] The goal of Bun is to run most of the world’s JavaScript outside of browsers, bringing performance and complexity enhancements to your future infrastructure, as well as developer productivity through better, simpler tooling.</p>\n</blockquote>\n\n<p class=\"x-netnewswire-hide\" style=\"padding-top: 1.5em;\"><em>Link: <strong><a href=\"https://bun.sh/\">bun.sh/</a></strong></em></p>\n"
      },
      {
         "title" : "Chasing Tail With Dr. Drang",
         "date_published" : "2022-07-06T13:32:00Z",
         "date_modified" : "2022-07-06T15:52:20Z",
         "id" : "https://daringfireball.net/linked/2022/07/06/drang-chasing-tail",
         "url" : "https://daringfireball.net/linked/2022/07/06/drang-chasing-tail",
         "external_url" : "https://leancrew.com/all-this/2022/07/tail-i-lose/",
         "authors" : [
            {
               "name" : "John Gruber"
            }
         ],
         "content_html" : "\n<p>Dr. Drang:</p>\n\n<blockquote>\n  <p>I’ve been using the <code>tail</code> command for about 25 years, so you might think I’d know something about it. But last week, as I was putting together a short shell script (not <a href=\"https://leancrew.com/all-this/2022/06/bbedit-tail-mode-and-bbtail/\">this one</a>), I opened the man page for <code>tail</code> and learned something new. Two things, actually, which surprised me, as <code>tail</code> doesn’t really do that much.</p>\n</blockquote>\n\n<p>The <code>-r</code> switch, to reverse lines, is good to know about but easy to forget — it’s not intuitive to think of a utility for viewing the end of a file as also being a convenient tool for reversing lines. And, as Drang points out, not all implementations of <code>tail</code> have this option.</p>\n\n<p class=\"x-netnewswire-hide\" style=\"padding-top: 1.5em;\"><em>Link: <strong><a href=\"https://leancrew.com/all-this/2022/07/tail-i-lose/\">leancrew.com/all-this/2022/07/tail-i-lose/</a></strong></em></p>\n"
      },
      {
         "title" : "TikTok Shops Are Lousy With Counterfeit Products",
         "date_published" : "2022-07-05T13:14:40Z",
         "date_modified" : "2022-07-05T13:20:06Z",
         "id" : "https://daringfireball.net/linked/2022/07/05/tiktok-shops-counterfeits",
         "url" : "https://daringfireball.net/linked/2022/07/05/tiktok-shops-counterfeits",
         "external_url" : "https://www.buzzfeednews.com/article/ikrd/tiktok-shop-customers-say-products-fake",
         "authors" : [
            {
               "name" : "John Gruber"
            }
         ],
         "content_html" : "\n<p>Ikran Dahir, reporting for BuzzFeed News:</p>\n\n<blockquote>\n  <p>Iman Hamid, a lawyer and author in London, was browsing TikTok in January when she came across a NYX lip gloss being sold on a livestream for just £3.99 (about $5) — almost half of the product’s original price. Thinking this was a good deal, she purchased the lip color — but once it arrived, she said she realized the discount was too good to be true.</p>\n\n<p>In a video she posted on TikTok in June, Hamid swatches the lip gloss she purchased on TikTok and compares it to the same color she bought at Superdrug to compare. The colors are starkly different and she says the texture didn’t match up. […]</p>\n\n<p>Several commenters on Hamid’s TikTok video shared their experiences of purchasing what they believed to be a fake product from TikTok. “Same happened to me with mascara,” one person said. Another warned, “if the price is too good to be true, it’s probably too good to be true.”</p>\n\n<p>“It’s shocking to me to see how many people have actually gone through the same problem,” Hamid told BuzzFeed News.</p>\n</blockquote>\n\n<p>This shouldn’t be shocking at all. Of course TikTok shops are riddled with scams. Of course name brand products being sold by rando TikTok users at half price are counterfeit.</p>\n\n<p class=\"x-netnewswire-hide\" style=\"padding-top: 1.5em;\"><em>Link: <strong><a href=\"https://www.buzzfeednews.com/article/ikrd/tiktok-shop-customers-say-products-fake\">buzzfeednews.com/article/ikrd/tiktok-shop-customers-say…</a></strong></em></p>\n"
      },
      {
         "title" : "[Sponsor] Tailscale SSH",
         "date_published" : "2022-07-04T20:41:30-05:00",
         "date_modified" : "2022-07-04T20:41:30-05:00",
         "id" : "https://daringfireball.net/feeds/sponsors/2022/07/tailscale_ssh",
         "url" : "https://daringfireball.net/feeds/sponsors/2022/07/tailscale_ssh",
         "external_url" : "https://tailscale.com/tailscale-ssh/?utm_source=df&utm_medium=RSS",
         "authors" : [
            {
               "name" : "Daring Fireball Department of Commerce"
            }
         ],
         "content_html" : "\n<p>Tailscale SSH: No more bastions. No more juggling keys. SSH that just works.</p>\n\n<p class=\"x-netnewswire-hide\" style=\"padding-top: 1.5em;\"><em>Link: <strong><a href=\"https://tailscale.com/tailscale-ssh/?utm_source=df&utm_medium=RSS\">tailscale.com/tailscale-ssh/?utm_source=df&utm_medium=RSS</a></strong></em></p>\n"
      },
      {
         "title" : "Tailscale",
         "date_published" : "2022-07-02T23:15:56Z",
         "date_modified" : "2022-07-02T23:15:57Z",
         "id" : "https://daringfireball.net/linked/2022/07/02/tailscale",
         "url" : "https://daringfireball.net/linked/2022/07/02/tailscale",
         "external_url" : "https://tailscale.com/tailscale-ssh/?utm_source=df&utm_medium=RSS",
         "authors" : [
            {
               "name" : "John Gruber"
            }
         ],
         "content_html" : "\n<p>My thanks to Tailscale for sponsoring this week at DF. Say hello to Tailscale SSH — and say goodbye to managing SSH keys, setting up bastion jump boxes, and unnecessarily exposing your private production devices to the open internet. Never deploy an infrastructure bastion again.</p>\n\n<p class=\"x-netnewswire-hide\" style=\"padding-top: 1.5em;\"><em>Link: <strong><a href=\"https://tailscale.com/tailscale-ssh/?utm_source=df&utm_medium=RSS\">tailscale.com/tailscale-ssh/?utm_source=df&utm_medium=RSS</a></strong></em></p>\n"
      },
      {
         "title" : "Joe Turkel Dies at 94",
         "date_published" : "2022-07-02T16:01:31Z",
         "date_modified" : "2022-07-02T16:09:03Z",
         "id" : "https://daringfireball.net/linked/2022/07/02/joe-turkel-rip",
         "url" : "https://daringfireball.net/linked/2022/07/02/joe-turkel-rip",
         "external_url" : "https://www.hollywoodreporter.com/movies/movie-news/joe-turkel-dead-shining-blade-runner-1235174986/",
         "authors" : [
            {
               "name" : "John Gruber"
            }
         ],
         "content_html" : "\n<p>He’ll always be the bartender.</p>\n\n<p class=\"x-netnewswire-hide\" style=\"padding-top: 1.5em;\"><em>Link: <strong><a href=\"https://www.hollywoodreporter.com/movies/movie-news/joe-turkel-dead-shining-blade-runner-1235174986/\">hollywoodreporter.com/movies/movie-news/joe-turkel-dead…</a></strong></em></p>\n"
      },
      {
         "title" : "The Talk Show: ‘Here You Go, Cheapskate’",
         "date_published" : "2022-07-01T23:51:32Z",
         "date_modified" : "2022-07-01T23:51:33Z",
         "id" : "https://daringfireball.net/linked/2022/07/01/the-talk-show-351",
         "url" : "https://daringfireball.net/linked/2022/07/01/the-talk-show-351",
         "external_url" : "https://daringfireball.net/thetalkshow/2022/07/01/ep-351",
         "authors" : [
            {
               "name" : "John Gruber"
            }
         ],
         "content_html" : "\n<p>Rene Ritchie returns to the show for more on Apple’s announcements from WWDC 2022, locking devices out of Face ID and Touch ID, passkeys, and more.</p>\n\n<p>Brought to you by these fine sponsors:</p>\n\n<ul>\n<li><a href=\"https://squarespace.com/talkshow\">Squarespace</a>: Make your next move. Use code <strong>talkshow</strong> for 10% off your first order.</li>\n<li><a href=\"https://memberful.com/talkshow\">Memberful</a>: Monetize your passion with membership. Start your free trial today.</li>\n<li><a href=\"https://kolide.com/thetalkshow\">Kolide</a>: Endpoint security for teams that Slack. Try Kolide for free today; no credit card required.</li>\n</ul>\n\n<p class=\"x-netnewswire-hide\" style=\"padding-top: 1.5em;\"><em>Link: <strong><a href=\"https://daringfireball.net/thetalkshow/2022/07/01/ep-351\">daringfireball.net/thetalkshow/2022/07/01/ep-351</a></strong></em></p>\n"
      },
      {
         "title" : "Republicans Working the Refs, Gmail Edition",
         "date_published" : "2022-07-01T23:49:14Z",
         "date_modified" : "2022-07-01T23:49:15Z",
         "id" : "https://daringfireball.net/linked/2022/07/01/republicans-working-gmail-refs",
         "url" : "https://daringfireball.net/linked/2022/07/01/republicans-working-gmail-refs",
         "external_url" : "https://www.axios.com/2022/06/29/gops-gmail-feud-escalates",
         "authors" : [
            {
               "name" : "John Gruber"
            }
         ],
         "content_html" : "\n<p>Lachlan Markay, reporting for Axios:</p>\n\n<blockquote>\n  <p>The Republican National Committee fired the latest shot on\nWednesday, when chairwoman Ronna McDaniel claimed in a statement\nto Axios that Google has “systematically attacked” its digital\nprogram. The RNC claims Google’s Gmail, the nation’s top email\nclient, has been suppressing fundraising emails during\nstrategically critical periods this year.</p>\n\n<p>Google told Axios its spam filter is thoroughly apolitical, and\nthat it’s taking steps to ensure political messages aren’t\ninadvertently flagged. [...] Google did not address the RNC’s\nspecific complaints, but stressed, “we do not filter emails based\non political affiliation.”</p>\n\n<p>“We recently asked the Federal Election Commission to advise us on\na potential pilot for political bulk senders that would provide\nmore transparency into email deliverability, while still letting\nusers protect their inboxes by unsubscribing or labeling emails as\nspam,” said Google spokesperson José Castañeda in an emailed\nstatement.</p>\n\n<p>That pilot, <a href=\"https://www.axios.com/2022/06/27/google-campaign-email-spam-gmail\">first reported by Axios</a> this week, would\ninitially exempt political senders from Gmail’s spam filter, while\ngiving recipients more visible options to flag those messages as\nspam going forward.</p>\n</blockquote>\n\n<p>For the sake of argument, let’s concede that Gmail flags as spam more political emails from Republicans than Democrats. I’d bet that this is in fact true — and if it’s <em>not</em> true, there’s no basis for this controversy.</p>\n\n<p>One possible explanation is that Google is doing this deliberately to hinder Republican fundraising. This is what the GOP is claiming.</p>\n\n<p>Another possible explanation is that GOP fundraising emails really do tend to be more spammy, both in content and in frequency, and thus should be getting flagged as spam more frequently than those from Democrats by non-partisan filtering algorithms. I.e. that Gmail’s spam filtering algorithms are biased only against junky messages. I get a lot of email from Democrats based on my political donations. I also voluntarily signed up for emails from the Trump campaign in the 2020 election, just to see what they were like. In my experience, the scenario I describe in this paragraph is almost certainly the case: Republican political emails are spammier.</p>\n\n<p>Fundraising emails from Democrats are very frequent, and often melodramatic in their ostensible urgency, but in my experience they are legit. Unsubscribe links are where you expect them at the bottom of the emails, and unsubscribing works.</p>\n\n<p>Fundraising emails from Republicans — especially those from the Trump campaign — look and read like scams. And, apparently, often now <em>are</em> outright scams — the Trump family has apparently <a href=\"https://gizmodo.com/donald-trump-fundraising-emails-250-million-jan-6-1849076009\">raised over $250 million <em>since</em> the 2020 election for an “Official Election Defense Fund” that doesn’t exist</a>. Emails with subject lines claiming that you have “<a href=\"https://twitter.com/joshtpm/status/1535068489899470848\">one hour to claim your free gift</a>”, or that Trump himself <a href=\"https://twitter.com/joshtpm/status/1535073486238269440\">has recorded a personal message just for you</a> but he needs some dough before he’ll send it to you. All political fundraising solicitations are a bit greasy, but the Trumpy ones are so scammy they’re beyond parody.</p>\n\n<p>The Republican argument is that Gmail (and all other email providers — but Gmail is the biggest in the U.S.) ought to flag Republican and Democratic emails as spam in equal measure, and if Republican emails are flagged more frequently, it’s prima facie evidence that Google is biased against Republicans. It’s like a basketball team that plays rough and <em>commits</em> a lot more fouls than their opponent but yells and screams that the refs are biased against them because more fouls are <em>called</em> against them. The refs aren’t biased if the team they flag for more fouls actually commits more fouls. And a spam filter isn’t biased if one party’s emails are more spammy and thus more likely to be flagged as spam.</p>\n\n<p>But it sounds like Google, eager to avoid being tagged as anti-conservative, is working on something to exempt political emails from their general spam filtering algorithms. I get it that this bullshit is a headache Google doesn’t need, but I’d like to see them stand firm that their spam filters are working as intended — flagging messages based on their junkiness, not their political slant.</p>\n\n<p class=\"x-netnewswire-hide\" style=\"padding-top: 1.5em;\"><em>Link: <strong><a href=\"https://www.axios.com/2022/06/29/gops-gmail-feud-escalates\">axios.com/2022/06/29/gops-gmail-feud-escalates</a></strong></em></p>\n"
      },
      {
         "title" : "President Biden to Award Steve Jobs a Posthumous Presidential Medal of Freedom",
         "date_published" : "2022-07-01T15:30:55Z",
         "date_modified" : "2022-07-01T15:33:39Z",
         "id" : "https://daringfireball.net/linked/2022/07/01/jobs-presidential-medal-of-freedom",
         "url" : "https://daringfireball.net/linked/2022/07/01/jobs-presidential-medal-of-freedom",
         "external_url" : "https://www.whitehouse.gov/briefing-room/statements-releases/2022/07/01/president-biden-announces-recipients-of-the-presidential-medal-of-freedom/",
         "authors" : [
            {
               "name" : "John Gruber"
            }
         ],
         "content_html" : "\n<p>Among other recipients this year: John McCain, Megan Rapinoe, Simone Biles, and Denzel Washington.</p>\n\n<p class=\"x-netnewswire-hide\" style=\"padding-top: 1.5em;\"><em>Link: <strong><a href=\"https://www.whitehouse.gov/briefing-room/statements-releases/2022/07/01/president-biden-announces-recipients-of-the-presidential-medal-of-freedom/\">whitehouse.gov/briefing-room/statements-releases/2022/07/01…</a></strong></em></p>\n"
      },
      {
         "title" : "Ketanji Brown Jackson Sworn in as 116th Supreme Court Justice",
         "date_published" : "2022-06-30T16:27:39Z",
         "date_modified" : "2022-06-30T16:33:15Z",
         "id" : "https://daringfireball.net/linked/2022/06/30/ketanji-brown-jackson-sworn-in",
         "url" : "https://daringfireball.net/linked/2022/06/30/ketanji-brown-jackson-sworn-in",
         "external_url" : "https://www.buzzfeednews.com/article/davidmack/ketanji-brown-jackson-sworn-in-supreme-court?bftwnews&utm_term=4ldqpgc#4ldqpgc",
         "authors" : [
            {
               "name" : "John Gruber"
            }
         ],
         "content_html" : "\n<p>Theodore Parker: “The arc of the moral universe is long, but it bends toward justice.”</p>\n\n<p>Keep the faith.</p>\n\n<p class=\"x-netnewswire-hide\" style=\"padding-top: 1.5em;\"><em>Link: <strong><a href=\"https://www.buzzfeednews.com/article/davidmack/ketanji-brown-jackson-sworn-in-supreme-court?bftwnews&utm_term=4ldqpgc#4ldqpgc\">buzzfeednews.com/article/davidmack/ketanji-brown-jackson…</a></strong></em></p>\n"
      },
      {
         "title" : "Instagram and Facebook Remove Posts Offering Abortion Pills",
         "date_published" : "2022-06-30T15:25:18Z",
         "date_modified" : "2022-06-30T15:25:19Z",
         "id" : "https://daringfireball.net/linked/2022/06/30/facebook-abortion-pills",
         "url" : "https://daringfireball.net/linked/2022/06/30/facebook-abortion-pills",
         "external_url" : "https://apnews.com/article/abortion-technology-politics-health-016eb3efd65dafc2b568af1495f5bac5",
         "authors" : [
            {
               "name" : "John Gruber"
            }
         ],
         "content_html" : "\n<p>Amanda Seitz, reporting for the AP:</p>\n\n<blockquote>\n  <p>The AP obtained a screenshot on Friday of one Instagram post from\na woman who offered to purchase or forward abortion pills through\nthe mail, minutes after the court ruled to overturn the\nconstitutional right to an abortion.</p>\n\n<p>“DM me if you want to order abortion pills, but want them sent to\nmy address instead of yours,” the post on Instagram read.</p>\n\n<p>Instagram took it down within moments. Vice Media first reported\non Monday that Meta, the parent of both Facebook and Instagram,\nwas <a href=\"https://www.vice.com/en/article/m7gav3/facebook-is-banning-people-who-say-they-will-mail-abortion-pills\">taking down posts about abortion pills</a>.</p>\n\n<p>On Monday, an AP reporter tested how the company would respond to\na similar post on Facebook, writing: “If you send me your address,\nI will mail you abortion pills.” The post was removed within one\nminute. The Facebook account was immediately put on a “warning”\nstatus for the post, which Facebook said violated its standards on\n“guns, animals and other regulated goods.”</p>\n\n<p>Yet, when the AP reporter made the same exact post but swapped out\nthe words “abortion pills” for “a gun,” the post remained\nuntouched. A post with the same exact offer to mail “weed” was\nalso left up and not considered a violation.</p>\n</blockquote>\n\n<p>Get your shit together, Facebook.</p>\n\n<p class=\"x-netnewswire-hide\" style=\"padding-top: 1.5em;\"><em>Link: <strong><a href=\"https://apnews.com/article/abortion-technology-politics-health-016eb3efd65dafc2b568af1495f5bac5\">apnews.com/article/abortion-technology-politics-health…</a></strong></em></p>\n"
      },
      {
         "title" : "Disney Celebrates 25th Anniversary of Chinese Rule in Hong Kong",
         "date_published" : "2022-06-30T14:32:10Z",
         "date_modified" : "2022-06-30T14:32:11Z",
         "id" : "https://daringfireball.net/linked/2022/06/30/winnie-jinping",
         "url" : "https://daringfireball.net/linked/2022/06/30/winnie-jinping",
         "external_url" : "https://www.nbcnews.com/video/china-s-xi-jinping-arrives-in-hong-kong-for-25th-anniversary-143149637720",
         "authors" : [
            {
               "name" : "John Gruber"
            }
         ],
         "content_html" : "\n<p>Just one character, though: roly-poly Winnie the Pooh.</p>\n\n<p class=\"x-netnewswire-hide\" style=\"padding-top: 1.5em;\"><em>Link: <strong><a href=\"https://www.nbcnews.com/video/china-s-xi-jinping-arrives-in-hong-kong-for-25th-anniversary-143149637720\">nbcnews.com/video/china-s-xi-jinping-arrives-in-hong-kong…</a></strong></em></p>\n"
      },
      {
         "title" : "F.C.C. Commissioner Brendan Carr Asks Apple and Google to Remove TikTok From App Stores",
         "date_published" : "2022-06-30T01:38:44Z",
         "date_modified" : "2022-06-30T21:05:09Z",
         "id" : "https://daringfireball.net/linked/2022/06/29/fcc-commission-tiktok-app-stores",
         "url" : "https://daringfireball.net/linked/2022/06/29/fcc-commission-tiktok-app-stores",
         "external_url" : "https://www.cnbc.com/2022/06/29/fcc-commissioner-tells-apple-google-to-remove-tiktok-from-app-stores.html",
         "authors" : [
            {
               "name" : "John Gruber"
            }
         ],
         "content_html" : "\n<p>Brendan Carr, one of the <a href=\"https://www.fcc.gov/about/leadership\">FCC’s commissioners</a> (a Republican), in a letter to Tim Cook and Sundar Pichai:</p>\n\n<blockquote>\n  <p>I am writing the two of you because Apple and Google hold\nthemselves out as operating app stores that are safe and trusted\nplaces to discover and download apps. Nonetheless, Apple and\nGoogle have reviewed and approved the TikTok app for inclusion in\nyour respective app stores. Indeed, statistics show that TikTok\nhas been downloaded in the U.S. from the Apple App Store and the\nGoogle Play Store nearly 19 million times in the first quarter of\nthis year alone. It is clear that TikTok poses an unacceptable\nnational security risk due to its extensive data harvesting being\ncombined with Beijing’s apparently unchecked access to that\nsensitive data. But it is also clear that TikTok’s pattern of\nconduct and misrepresentations regarding the unfettered access\nthat persons in Beijing have to sensitive U.S. user data- just\nsome of which is detailed below-puts it out of compliance with the\npolicies that both of your companies require every app to adhere\nto as a condition of remaining available on your app stores.\nTherefore, I am requesting that you apply the plain text of your\napp store policies to TikTok and remove it from your app stores\nfor failure to abide by those terms.</p>\n\n<p>TikTok is not what it appears to be on the surface. It is not just\nan app for sharing funny videos or memes. That’s the sheep’s\nclothing. At its core, TikTok functions as a sophisticated\nsurveillance tool that harvests extensive amounts of personal and\nsensitive data. [...]</p>\n\n<p>Moreover, Apple and Google have long claimed to operate their app\nstores in a manner that protects consumer privacy and safeguards\ntheir data. Therefore, I am requesting that you apply your app\nstore policies to TikTok and remove it from the Apple App Store\nand the Google Play Store for failing to comply with those\npolicies. If you do not remove TikTok from your app stores, please\nprovide separate responses to me by July 8, 2022, explaining the\nbasis for your company’s conclusion that the surreptitious access\nof private and sensitive U.S. user data by persons located in\nBeijing, coupled with TikTok’s pattern of misleading\nrepresentations and conduct, does not run afoul of any of your app\nstore policies.</p>\n</blockquote>\n\n<p>This whole charade about moving U.S. TikTok users’ data to servers run by Oracle is a facade — there’s nothing stopping ByteDance employees in China from accessing the data on those servers. The Biden administration shouldn’t merely request that Apple and Google ban TikTok from their App Stores, they should demand it.</p>\n\n<p class=\"x-netnewswire-hide\" style=\"padding-top: 1.5em;\"><em>Link: <strong><a href=\"https://www.cnbc.com/2022/06/29/fcc-commissioner-tells-apple-google-to-remove-tiktok-from-app-stores.html\">cnbc.com/2022/06/29/fcc-commissioner-tells-apple-google-to…</a></strong></em></p>\n"
      },
      {
         "title" : "Atari Turns 50",
         "date_published" : "2022-06-28T21:29:24Z",
         "date_modified" : "2022-06-28T21:35:58Z",
         "id" : "https://daringfireball.net/linked/2022/06/28/atari-turns-50",
         "url" : "https://daringfireball.net/linked/2022/06/28/atari-turns-50",
         "external_url" : "https://www.howtogeek.com/812246/atari-was-very-very-hard-nolan-bushnell-on-atari-50-years-later/",
         "authors" : [
            {
               "name" : "John Gruber"
            }
         ],
         "content_html" : "\n<p>Commemorating the 50th anniversary of Atari, Benj Edwards interviewed founder Nolan Bushnell for How-To Geek:</p>\n\n<blockquote>\n  <p><b>Benj Edwards, How-To Geek:</b> Do you think the video game\n   industry has lost sight of any innovations from the early days\n   of Atari?</p>\n\n<p><b>Nolan Bushnell:</b> A little bit. Remember that Atari was\n   founded as a coin-op company. And coin-op has this requirement\n   that a newbie has to get into the game almost instantly without\n   reading instructions. So the simplicity of onboarding is lost\n   by a lot of people right now. [...]</p>\n\n<p><b>HTG:</b> What did you do “right” in the early years of Atari\n   that people could learn from today?</p>\n\n<p><b>Bushnell:</b> We did really good branding. And I think that, in\n   terms of our graphic badges and our logo and everything, we\n   wanted to have a distinct look. I think it’s held together.\n   Right now, the Atari logo is the only thing that’s still really\n   vibrant.</p>\n\n<p><b>HTG:</b> Apple used iconic branding successfully too, and Steve\n   Jobs was one of your early employees. Do you think that rubbed\n   off on Apple?</p>\n\n<p><b>Bushnell:</b> I think so, because Jobs used to ride up to my\n   house on Sunday mornings on his motorcycle. And we’d drink tea\n   and talk about things. And I talked about the importance of\n   branding and color palettes and things like that — how a brand\n   and look is multi-faceted. You’ve never really thought about a\n   color palette as being unique to a company, and yet it’s\n   axiomatic.</p>\n</blockquote>\n\n<p>Atari was the first computer company I ever loved. Still love those old machines and games, and still love that logo.</p>\n\n<p><strong>Bonus link:</strong> <a href=\"https://twitter.com/CommodoreBlog/status/1541309427311149056\">This terrific TV commercial for the Atari 2600</a> from the early 1980s, also <a href=\"https://twitter.com/benjedwards/status/1541606652973305856\">via Edwards</a>.</p>\n\n<p class=\"x-netnewswire-hide\" style=\"padding-top: 1.5em;\"><em>Link: <strong><a href=\"https://www.howtogeek.com/812246/atari-was-very-very-hard-nolan-bushnell-on-atari-50-years-later/\">howtogeek.com/812246/atari-was-very-very-hard-nolan…</a></strong></em></p>\n"
      },
      {
         "title" : "Period Tracking App Stardust Seems a Little Sketchy",
         "date_published" : "2022-06-28T21:13:42Z",
         "date_modified" : "2022-06-29T19:31:20Z",
         "id" : "https://daringfireball.net/linked/2022/06/28/stardust",
         "url" : "https://daringfireball.net/linked/2022/06/28/stardust",
         "external_url" : "https://techcrunch.com/2022/06/27/stardust-period-tracker-phone-number/",
         "authors" : [
            {
               "name" : "John Gruber"
            }
         ],
         "content_html" : "\n<p>Sarah Perez and Zack Whittaker, reporting for TechCrunch yesterday:</p>\n\n<blockquote>\n  <p>Others are abandoning their current period trackers and turning to\napps like Stardust instead as a result of the company’s <a href=\"https://www.tiktok.com/@stardust.app/video/7112878594275282222\">strong\nstatement</a> issued in light of the decision to overturn Roe.\nStardust said it would implement end-to-end encryption so it would\n“not be able to hand over any of your period tracking data” to the\ngovernment, helping to draw in hundreds of thousands of downloads\nover this weekend ahead of the release of the new,\nencryption-featured app version slated for release on Wednesday.</p>\n</blockquote>\n\n<p>First strike: <a href=\"https://minnow-clarinet-j6yf.squarespace.com/\">Stardust bills itself</a> as an astrology-based period tracker: “Harness your inner cosmic energy with Stardust, an app that integrates science, astronomy and artificial intelligence to connect your hormonal cycle with the cycles of larger celestial bodies: the stars, planets, sun, and moon.” I wouldn’t take advice at the craps table from someone who believes in astrology, let alone trust them with my medical data.</p>\n\n<p>(Sidenote: “minnow-clarinet-j6yf.squarespace.com” is an odd domain name for an ostensibly serious personal health company.)</p>\n\n<p>Second strike: end-to-end encryption isn’t something you just add in a matter of days.</p>\n\n<blockquote>\n  <p>TechCrunch ran a network traffic analysis of Stardust’s iPhone\napp on Monday to understand what data was flowing in and out of\nthe app. The network traffic showed that if a user logs into the\napp using their phone number (rather than through a login service\nprovided by Apple or Google), Stardust will periodically share\nthe user’s phone number with a third-party analytics service\ncalled Mixpanel. [...] During the network traffic analysis,\nTechCrunch saw no health data shared with Mixpanel. But sharing a\nphone number that’s tied to a specific user of a period-tracking\napp with a third party like Mixpanel could allow prosecutors to\ncompel Mixpanel to turn over that data — even if Stardust claims\nthat it can’t.</p>\n</blockquote>\n\n<p>That does not sound like an app that takes user privacy seriously.</p>\n\n<blockquote>\n  <p>TechCrunch asked the founders for more information about how the\napp is implementing end-to-end encryption. Stardust founder\nMoranis told TechCrunch that “all traffic to our servers is\nthrough standard SSL (hosted on AWS) and subsequent data storage\non AWS RDS utilizing their built-in AES-256 encryption\nimplementation.” Although this describes the use of encryption to\nprotect data while in transit and while it’s stored on Amazon’s\nservers, it’s not clear if this implementation would be considered\ntrue end-to-end encryption.</p>\n\n<p>Given its complexity and the stakes involved, implementing\nend-to-end encryption is often a time- and resource-intensive\neffort, where a single coding flaw could undermine the protections\nof the users’ data. [...] When asked if the company had\nconducted a third-party security audit of the app’s code, Moranis\nsaid that the company intends to “fully publish our implementation\nalong with a third-party audit once it is complete,” but a\ntimeline was not given. [...]</p>\n\n<p>After we heard from Stardust, the company quietly changed its\nprivacy policy again to remove mentions of end-to-end encryption.</p>\n</blockquote>\n\n<p>This doesn’t really make any sense. My best guess is that Stardust’s leadership saw an opportunity to appeal to privacy-concerned women after Friday’s Supreme Court decision overturning <em>Roe v. Wade</em>, <a href=\"https://www.vice.com/en/article/y3pgvg/the-1-period-tracker-on-the-app-store-will-hand-over-data-without-a-warrant\">struck gold</a> by <a href=\"https://mashable.com/article/stardust-period-tracker-app-privacy\">claiming</a> to be secure and privacy-focused, but they didn’t actually know what “end-to-end encryption” really means.</p>\n\n<p class=\"x-netnewswire-hide\" style=\"padding-top: 1.5em;\"><em>Link: <strong><a href=\"https://techcrunch.com/2022/06/27/stardust-period-tracker-phone-number/\">techcrunch.com/2022/06/27/stardust-period-tracker-phone…</a></strong></em></p>\n"
      },
      {
         "title" : "★ The New Prohibition",
         "date_published" : "2022-06-28T16:50:01Z",
         "date_modified" : "2022-06-28T17:07:23Z",
         "id" : "https://daringfireball.net/2022/06/the_new_prohibition",
         "url" : "https://daringfireball.net/2022/06/the_new_prohibition",
         "authors" : [
            {
               "name" : "John Gruber"
            }
         ],
         "content_html" : "\n<p><a href=\"https://www.theatlantic.com/ideas/archive/2022/06/abortion-roe-prolife-movement-prohibition/661402/\">David Frum, writing for The Atlantic</a>:</p>\n\n<blockquote>\n  <p>The culture war raged most hotly from the ’70s to the next\ncentury’s ’20s. It polarized American society, dividing men from\nwomen, rural from urban, religious from secular, Anglo-Americans\nfrom more recent immigrant groups. At length, but only after a\ntitanic constitutional struggle, the rural and religious side of\nthe culture imposed its will on the urban and secular side. A\ndecisive victory had been won, or so it seemed.</p>\n\n<p>The culture war I’m talking about is the culture war over alcohol\nprohibition. From the end of Reconstruction to the First World\nWar, probably more state and local elections turned on that one\nissue than on any other. The long struggle seemingly culminated in\n1919, with the ratification of the Eighteenth Amendment and\nenactment by Congress of the National Prohibition Act, or the\nVolstead Act (as it became known). The amendment and the act\ntogether outlawed the manufacture and sale of alcoholic beverages\nin the United States and all its subject territories. Many urban\nand secular Americans experienced those events with the same\nfeeling of doom as pro-choice Americans may feel today after the\nSupreme Court’s overturning of <em>Roe v. Wade</em>.</p>\n\n<p>Only, it turns out that the Volstead Act was not the end of the\nstory. As Prohibition became a nationwide reality, Americans\nrapidly changed their mind about the idea. Support for Prohibition\ndeclined, then collapsed. Not only was the Volstead Act repealed,\nin 1933, but the Constitution was further amended so that nobody\ncould ever try such a thing ever again.</p>\n</blockquote>\n\n<p>The analogy isn’t perfect, but no analogy ever is. I’ll start by noting the obvious: that women’s reproductive rights and bodily autonomy are far more essential than the right to consume alcohol (or any other drug) recreationally. The stakes are immeasurably higher.</p>\n\n<p>That said, I find Frum’s analogy compelling, <em>politically</em>. Optimistically, the repeal of Prohibition was resounding, and seemingly stands as proof that something so deeply unpopular cannot stand in a democracy. Pessimistically, the repeal of Prohibition — despite its deep unpopularity and obvious failure — took 14 years. From our perspective today, Prohibition looks like a bizarre, brief blip in American history; to those who lived through it, <a href=\"https://itunes.apple.com/us/tv-season/prohibition-a-film-by-ken-burns-and-lynn-novick/id464144773\">it was a long and painful slog</a>.</p>\n\n<p>More pessimistic, of course, is the fact that <a href=\"https://www.nytimes.com/news-event/jan-6-committee\">American democracy itself is in severe crisis</a>. Deeply unpopular laws and the suppression of fundamental human rights are the norm in autocracies.</p>\n\n\n\n    "
      },
      {
         "title" : "Trump Lawyer John Eastman Probably Wishes He Knew How to Hard-Lock His iPhone",
         "date_published" : "2022-06-28T15:50:08Z",
         "date_modified" : "2022-06-28T17:35:22Z",
         "id" : "https://daringfireball.net/linked/2022/06/28/eastman-iphone-searched",
         "url" : "https://daringfireball.net/linked/2022/06/28/eastman-iphone-searched",
         "external_url" : "https://edition.cnn.com/2022/06/27/politics/john-eastman-search-phone-january-6/index.html",
         "authors" : [
            {
               "name" : "John Gruber"
            }
         ],
         "content_html" : "\n<p>CNN:</p>\n\n<blockquote>\n  <p>FBI seized the phone of former President Donald Trump’s election\nattorney John Eastman last week, according to a new court filing\nfrom the conservative lawyer. Last Wednesday, about six federal\ninvestigators approached Eastman in New Mexico when he was\nexiting a restaurant after dinner with his wife and a friend,\naccording to the court filings. He was patted down, and “forced\nto provide [facial] biometric data to open” the phone, Eastman’s\ncourt filing said.</p>\n\n<p>Agents were able to get access to Eastman’s email accounts on his\niPhone 12 Pro, the filings said.</p>\n</blockquote>\n\n<p><a href=\"https://s3.documentcloud.org/documents/22071050/john-eastman-court-filing.pdf\">CNN posted a copy of Eastman’s court filing</a>, which contains the original warrant as an attachment. From the warrant:</p>\n\n<blockquote>\n  <p>During the execution of the search of the authorized places, law\nenforcement personnel are also specifically authorized to obtain\nfrom the Subjects (but not any other individuals present at the\ntime of execution of the warrant) the compelled display of any\nphysical biometric characteristics (such as\nfingerprint/thumbprint, facial characteristics, or iris display)\nnecessary to unlock any device(s) requiring such biometric access\nsubject to seizure pursuant to this warrant for which law\nenforcement has reasonable suspicion that the aforementioned\nperson(s)’ physical biometric characteristics will unlock the\ndevice(s), to include pressing fingers or thumbs against and/or\nputting a face before the sensor, or any other security feature\nrequiring biometric recognition of any of the devices, for the\npurpose of attempting to unlock the device(s)’s security features\nin order to search the contents as authorized by this warrant.</p>\n\n<p>While attempting to unlock the device by use of the compelled\ndisplay of biometric characteristics pursuant to this warrant, law\nenforcement is not authorized to demand that the aforementioned\nperson(s) state or otherwise provide the password or identify the\nspecific biometric characteristics (including the unique finger(s)\nor other physical features), that may be used to unlock or access\nthe device(s). Nor does the warrant authorize law enforcement to\nuse the fact that the warrant allows law enforcement to obtain the\ndisplay of any biometric characteristics to compel the\naforementioned person(s) to state or otherwise provide that\ninformation. However, the voluntary disclosure of such information\nby the aforementioned person(s) is permitted. To avoid confusion\non that point, if agents in executing the warrant ask any of the\naforementioned person(s) for the password to any device(s), or to\nidentify which biometric characteristic (including the unique\nfinger(s) or other physical features) unlocks any device(s), the\nagents will not state or otherwise imply that the warrant requires\nthe person to provide such information, and will make clear that\nproviding any such information is voluntary and that the person is\nfree to refuse the request.</p>\n</blockquote>\n\n<p>That this story broke the same day <a href=\"https://daringfireball.net/2022/06/require_a_passcode_to_unlock_your_iphone\">I published a piece explaining how to hard-lock an iPhone</a> to disable Face ID and Touch ID authentication until the device passcode has been entered, is rather amazing. I was inspired to post that yesterday in light of privacy concerns stemming from the Supreme Court’s repeal of abortion rights in America, but the situation I described — that law enforcement can force you to use your fingerprints or face to unlock a device, but cannot force you to reveal your passcode — is perfectly exemplified by the warrant against Eastman.</p>\n\n<p>Watching the video of Eastman’s iPhone being confiscated, it’s possible he had no opportunity to hard-lock the device even if he’d known how to. The video Eastman gave to Fox News <a href=\"https://www.cnn.com/videos/politics/2022/06/28/eastman-phone-seized-fbi-jan-6-polantz-nr-sot-vpx.cnn\">starts with him with his hands already on his head</a>, and an FBI agent frisking him, finding the phone in a belt holster, and taking it.</p>\n\n<p class=\"x-netnewswire-hide\" style=\"padding-top: 1.5em;\"><em>Link: <strong><a href=\"https://edition.cnn.com/2022/06/27/politics/john-eastman-search-phone-january-6/index.html\">edition.cnn.com/2022/06/27/politics/john-eastman-search…</a></strong></em></p>\n"
      },
      {
         "title" : "The Talk Show: ‘Your Sack of Meat With Teeth’",
         "date_published" : "2022-06-28T02:29:07Z",
         "date_modified" : "2022-06-28T02:29:08Z",
         "id" : "https://daringfireball.net/linked/2022/06/27/the-talk-show-350",
         "url" : "https://daringfireball.net/linked/2022/06/27/the-talk-show-350",
         "external_url" : "https://daringfireball.net/thetalkshow/2022/06/27/ep-350",
         "authors" : [
            {
               "name" : "John Gruber"
            }
         ],
         "content_html" : "\n<p>Jason Snell returns to the show to discuss the biggest threads from WWDC 2022 — in particular, Stage Manager and the M2 MacBook Air and 13-inch MacBook “Pro”. No sports talk (unless you count soccer).</p>\n\n<p>Brought to you by:</p>\n\n<ul>\n<li><a href=\"https://www.revenuecat.com\">RevenueCat</a>: In-app subscriptions made easy.</li>\n<li><a href=\"https://linode.com/thetalkshow\">Linode</a>: Instantly deploy and manage an SSD server in the Linode Cloud. New accounts get a $100 credit.</li>\n<li><a href=\"https://squarespace.com/talkshow\">Squarespace</a>: Make your next move. Use code <strong>talkshow</strong> for 10% off your first order.</li>\n<li><a href=\"https://kolide.com/thetalkshow\">Kolide</a>: Endpoint Security for teams that Slack. Try Kolide for free today; no credit card required.</li>\n</ul>\n\n<p class=\"x-netnewswire-hide\" style=\"padding-top: 1.5em;\"><em>Link: <strong><a href=\"https://daringfireball.net/thetalkshow/2022/06/27/ep-350\">daringfireball.net/thetalkshow/2022/06/27/ep-350</a></strong></em></p>\n"
      },
      {
         "title" : "★ How to Temporarily Disable Face ID or Touch ID, and Require a Passcode to Unlock Your iPhone or iPad",
         "date_published" : "2022-06-27T19:52:44Z",
         "date_modified" : "2022-06-28T00:44:56Z",
         "id" : "https://daringfireball.net/2022/06/require_a_passcode_to_unlock_your_iphone",
         "url" : "https://daringfireball.net/2022/06/require_a_passcode_to_unlock_your_iphone",
         "authors" : [
            {
               "name" : "John Gruber"
            }
         ],
         "content_html" : "\n<p>I’ve written about this — e.g. <a href=\"https://daringfireball.net/linked/2017/08/18/ios-11-cop-button\">here</a> and <a href=\"https://daringfireball.net/2021/09/initial_details_on_ids_in_apple_wallet#fn1-2021-09-01\">here</a> — but because I consider it one of the single most important things to know about iOS, I should write about it more often. Even if you’re not the sort of person who typically shares iPhone tips with your friends and relatives, this is one that you should spread the word about.</p>\n\n<p>The problem is this: if you use Face ID or Touch ID on your device (and you almost certainly should), what happens if law enforcement (or anyone else for that matter) takes your device and physically forces you to unlock it biometrically? There is <a href=\"https://daringfireball.net/linked/2017/08/18/cops-fingerprints\">some legal precedent</a> supporting the notion that police can force you to do this, but can’t force you to provide them with a passcode or passphrase.</p>\n\n<p>Here are two essential things everyone should know.</p>\n\n<p>The first is hard-locking. When you hard-lock your iPhone or iPad, it enters a mode that requires the device passcode to unlock. With recent iPhones and iPads, you enter this mode the same way that you turn off the device: <a href=\"https://support.apple.com/en-us/HT208076\">by pressing and holding the power button and either of the volume buttons for about two seconds</a>.<sup id=\"fnr1-2022-06-27\"><a href=\"#fn1-2022-06-27\">1</a></sup> You’ll know when you’ve pressed the buttons long enough because there’s haptic feedback.<sup id=\"fnr2-2022-06-27\"><a href=\"#fn2-2022-06-27\">2</a></sup> This takes you to the screen where you see a slider to power down the device, and on iPhones, where you can initiate an Emergency SOS call or view the device owner’s Medical ID (if they have one). The important thing to note is that you don’t have to do anything on this screen to hard-lock your device — once you’ve gotten to this screen, the device is already hard-locked and will require the passcode to unlock. You can’t use Face ID or Touch ID again until the passcode has been entered. This is important because it means you can easily hard-lock your iPhone without even looking at it, or removing it from your pocket or purse. That you can do this surreptitiously is very much by design.</p>\n\n<p>Just press and hold the buttons on both sides. Remember that. Try it now. Don’t just memorize it, internalize it, so that you’ll be able to do it without much thought while under duress, like if you’re confronted by a police officer. Remember to do this <em>every</em> time you’re separated from your phone, like when going through the magnetometer at any security checkpoint, especially airports. As soon as you see a metal detector ahead of you, you should think, “Hard-lock my iPhone”.</p>\n\n<p>The second thing is to know your rights. Never <em>ever</em> hand your phone to a cop or anyone vaguely cop-like, like the rent-a-cops working for TSA. If they tell you that you must, refuse. They can and will lie to you about this. If you really need to hand it over, they’ll take it from you. And they won’t get anything from it, because you’ll have already hard-locked it, and you’ll know that you cannot be required to give them your passcode.</p>\n\n<div class=\"footnotes\">\n<hr />\n<ol>\n\n<li id=\"fn1-2022-06-27\">\n<p>You can also do the same thing by quickly pressing the side button alone five times. On older iPhones (iPhone 7 and earlier), rapidly pressing the side button five times will immediately initiate the SOS phone call to emergency services; on iPhone 8 and later it just takes you to the same lock screen as when you press and hold the side button along with a volume button. I find the press-and-hold method easier to remember. I think of it as squeezing my iPhone for a moment to protect its contents.&nbsp;<a href=\"#fnr1-2022-06-27\"  class=\"footnoteBackLink\"  title=\"Jump back to footnote 1 in the text.\">&#x21A9;&#xFE0E;</a></p>\n</li>\n\n<li id=\"fn2-2022-06-27\">\n<p>This haptic feedback/confirmation only occurs if “Vibrate on Ring” is turned on in Settings → Sounds & Haptics. I feel like this haptic feedback should occur regardless of this setting.&nbsp;<a href=\"#fnr2-2022-06-27\"  class=\"footnoteBackLink\"  title=\"Jump back to footnote 2 in the text.\">&#x21A9;&#xFE0E;︎</a></p>\n</li>\n\n</ol>\n</div>\n\n\n\n    "
      },
      {
         "title" : "Claim Chowder: Kathleen ‘Calm Down’ Parker Edition",
         "date_published" : "2022-06-27T19:04:43Z",
         "date_modified" : "2022-06-27T19:19:40Z",
         "id" : "https://daringfireball.net/linked/2022/06/27/claim-chowder-kathleen-parker",
         "url" : "https://daringfireball.net/linked/2022/06/27/claim-chowder-kathleen-parker",
         "external_url" : "https://www.washingtonpost.com/opinions/calm-down-roe-v-wade-isnt-going-anywhere/2018/07/03/fd470196-7f05-11e8-bb6b-c1cb691f1402_story.html",
         "authors" : [
            {
               "name" : "John Gruber"
            }
         ],
         "content_html" : "\n<p>Kathleen Parker, opining for The Washington Post four years ago, on the cusp of Trump’s nomination of Brett Kavanaugh to replace Anthony Kennedy on the Supreme Court:</p>\n\n<blockquote>\n  <p>What new justice would want to be <em>that</em> man or woman, who\nforevermore would be credited with upending settled law and\ncausing massive societal upheaval? As for other conservative\njustices, only <a href=\"https://www.washingtonpost.com/politics/whitehouse/more-conservative-court-may-weaken-not-kill-abortion-rights/2018/06/28/7cebf26c-7b19-11e8-ac4e-421ef7165923_story.html\">Clarence Thomas</a> would likely vote to\noverturn <em>Roe v. Wade</em>. Sen. Susan Collins (R-Maine), one of the\nmost important voices in this discussion, echoed the thoughts of\nclose-to-the-court sources, who told me that neither Chief Justice\nJohn G. Roberts Jr. nor Neil M. Gorsuch would likely want to wade\ninto that swamp and weigh in on a <em>Roe v. Wade</em> reversal.</p>\n</blockquote>\n\n<p>The headline: “Calm Down. Roe v. Wade Isn’t Going Anywhere.”</p>\n\n<p>This, from the same columnist who wrote on 4 November 2016, “<a href=\"https://web.archive.org/web/20180629014747/https://www.washingtonpost.com/politics/whitehouse/more-conservative-court-may-weaken-not-kill-abortion-rights/2018/06/28/7cebf26c-7b19-11e8-ac4e-421ef7165923_story.html?utm_term=.68cbae879d99\">Calm Down. We’ll Be Fine No Matter Who Wins</a>.”</p>\n\n<p>(<a href=\"https://twitter.com/jayrosen_nyu/status/1541487967155486722\">Via Jay Rosen, who observes</a>, “That scene from <em>Shawshank</em> comes to mind: ‘You don’t seem to be a very good thief. Maybe you should try something else.’”)</p>\n\n<p class=\"x-netnewswire-hide\" style=\"padding-top: 1.5em;\"><em>Link: <strong><a href=\"https://www.washingtonpost.com/opinions/calm-down-roe-v-wade-isnt-going-anywhere/2018/07/03/fd470196-7f05-11e8-bb6b-c1cb691f1402_story.html\">washingtonpost.com/opinions/calm-down-roe-v-wade-isnt-going…</a></strong></em></p>\n"
      },
      {
         "title" : "Epic’s 95/5 Split for Fortnite Content Creators",
         "date_published" : "2022-06-27T18:50:29Z",
         "date_modified" : "2022-06-28T18:03:26Z",
         "id" : "https://daringfireball.net/linked/2022/06/27/epic-95-split",
         "url" : "https://daringfireball.net/linked/2022/06/27/epic-95-split",
         "external_url" : "https://www.theverge.com/23139858/fortnite-creators-creative-studios-branded-worlds",
         "authors" : [
            {
               "name" : "John Gruber"
            }
         ],
         "content_html" : "\n<p>Jay Peters, writing for The Verge:</p>\n\n<blockquote>\n  <p>For the Fortnite groups I talked to, the Creator Codes can be an\ninefficient way to get revenue, since they have to find ways to\nconvince people to enter the code. In some maps I’ve played,\nthough, there’s a prompt right at the beginning that lets you use\nthe code with just a couple button presses. But creators don’t get\nmuch of the share of what’s purchased. In Fortnite, creators earn\n5 percent of the value of in-game purchases made using their\nCreator Code, <a href=\"https://www.epicgames.com/affiliate/en-US/overview\">Epic says on its website</a>.</p>\n\n<p>In an FAQ, Epic spells out a couple examples of how the payouts\nmight work — and explicitly cautions creators to “expect modest\nresults”:</p>\n\n<blockquote>\n  <p>Q: Will This Program Make Creators Rich?</p>\n\n<p>A: Please expect modest results. The amount you earn scales with\n   the number of players who choose to support you. A Fortnite\n   example: If your in-game supporters spend 50,000 V-Bucks\n   in-game, then you would earn $25 USD. An Epic Games Store\n   example: if your supporters purchase $100 of games, you’ll\n   earn $5 (at the base Epic-funded rate).</p>\n</blockquote>\n</blockquote>\n\n<p>Sounds like we have a solution to Epic’s years-long complaint about Apple and Google taking a 15–30 percent cut of in-app transactions. They should follow Epic’s lead and take a 95 percent cut instead. Support a creator, indeed.</p>\n\n<p>Or, perhaps, different revenue splits are “fair” in different contexts.</p>\n\n<p class=\"x-netnewswire-hide\" style=\"padding-top: 1.5em;\"><em>Link: <strong><a href=\"https://www.theverge.com/23139858/fortnite-creators-creative-studios-branded-worlds\">theverge.com/23139858/fortnite-creators-creative-studios…</a></strong></em></p>\n"
      },
      {
         "title" : "Period-Tracking Apps and Data Privacy in Post-Roe America",
         "date_published" : "2022-06-27T16:33:32Z",
         "date_modified" : "2022-06-28T01:46:03Z",
         "id" : "https://daringfireball.net/linked/2022/06/27/period-tracking-post-roe",
         "url" : "https://daringfireball.net/linked/2022/06/27/period-tracking-post-roe",
         "external_url" : "https://www.npr.org/2022/05/10/1097482967/roe-v-wade-supreme-court-abortion-period-apps",
         "authors" : [
            {
               "name" : "John Gruber"
            }
         ],
         "content_html" : "\n<p>Rina Torchinsky, reporting for NPR on an issue that is <a href=\"https://www.washingtonpost.com/technology/2022/05/07/period-tracking-privacy/\">now top-of-mind</a> for women across the United States:</p>\n\n<blockquote>\n  <p>For those second-guessing their period-tracking app, Ford says\nthere’s a risk vs. convenience calculation that’s different for\neach user. It depends in large part on where you live and what the\nlaws are.</p>\n\n<p>“If I lived in a state where abortion was actively being\ncriminalized, I would not use a period tracker — that’s for\nsure,” she says.</p>\n\n<p>But for those who choose to log their data online, there might be\nsome options that aren’t as risky. Ford says that apps built with\na nonprofit model could offer more privacy. Hong says paid apps\ncould be better because they’re less likely to track users, since\nthey don’t need to collect advertising data. Hong also advised\nusers to read Apple’s privacy nutrition labels, which are designed\nto show users how their data is used in simpler terms.</p>\n\n<p>Apps that store data locally are also preferable, Greer explained,\nbecause when data is stored locally, the user owns it — not the\ncompany.</p>\n</blockquote>\n\n<p>The article, unfortunately, does not mention the iOS Health app specifically, but should. Apple’s Health data is only accessible on the user’s device(s). <a href=\"https://support.apple.com/en-us/HT209519\">From Apple’s support documentation on health records and privacy</a>:</p>\n\n<blockquote>\n  <p>By default, iCloud automatically keeps your Health app data,\nincluding health records, up to date across your devices. To\ndisable this feature, open iCloud settings and turn off Health.\niCloud protects your health records data by encrypting it both in\nstorage and during transmission. If you’re using iOS 12 or later\nand have turned on <a href=\"https://support.apple.com/kb/HT207198\">two-factor authentication</a> for your Apple\nID, health records are encrypted using end-to-end encryption\nthrough iCloud. This means only you can access this information,\nand only on devices where you’re signed in to iCloud. No one else,\nnot even Apple, can access end-to-end encrypted information.</p>\n</blockquote>\n\n<p>In other words, it’s not merely a policy that Apple will keep your health data — all of it — private on iCloud. If you’re using <a href=\"https://support.apple.com/en-us/HT204915\">two-factor authentication for your iCloud account</a> — and you most definitely should be — it’s mathematically secure via end-to-end encryption. Apple not only <em>won’t</em> hand it over in the face of a demand from law enforcement in a state where abortion has been criminalized, they <em>can’t</em>.</p>\n\n<p>I don’t mean to glibly suggest that Apple Health is a panacea for this dilemma. It’s certainly worth worrying about which third-party apps you grant access to your Health data, for one thing. And for another, data stored on-device is still accessible to law enforcement if they have possession of the device and can unlock  it. But it’s a distinction worth noting. HealthKit was designed from the ground up to be cryptographically secure in this way — a fundamental difference <a href=\"https://www.wsj.com/articles/period-tracker-apps-aim-for-anonymity-following-roe-v-wade-decision-11656202089?mod=tech_lead_pos1\">from cloud-based period tracking services that are only now working on “anonymous” modes</a>.</p>\n\n<p>You can check which apps have access to what Health data in Settings → Health → Data Access &amp; Devices.</p>\n\n<p class=\"x-netnewswire-hide\" style=\"padding-top: 1.5em;\"><em>Link: <strong><a href=\"https://www.npr.org/2022/05/10/1097482967/roe-v-wade-supreme-court-abortion-period-apps\">npr.org/2022/05/10/1097482967/roe-v-wade-supreme-court…</a></strong></em></p>\n"
      },
      {
         "title" : "America Is Growing Apart",
         "date_published" : "2022-06-26T15:19:25Z",
         "date_modified" : "2022-06-26T15:22:09Z",
         "id" : "https://daringfireball.net/linked/2022/06/26/america-growing-apart",
         "url" : "https://daringfireball.net/linked/2022/06/26/america-growing-apart",
         "external_url" : "https://www.theatlantic.com/politics/archive/2022/06/red-and-blue-state-divide-is-growing-michael-podhorzer-newsletter/661377/",
         "authors" : [
            {
               "name" : "John Gruber"
            }
         ],
         "content_html" : "\n<p>Ronald Brownstein, writing for The Atlantic:</p>\n\n<blockquote>\n  <p>All of this is fueling what I’ve called “the great divergence” now under way between red and blue states. This divergence itself creates enormous strain on the country’s cohesion, but more and more even that looks like only a way station. What’s becoming clearer over time is that the Trump-era GOP is hoping to use its electoral dominance of the red states, the small-state bias in the Electoral College and the Senate, and the GOP-appointed majority on the Supreme Court to impose its economic and social model on the entire nation — with or without majority public support. As measured on fronts including the January 6 insurrection, the procession of Republican 2020 election deniers running for offices that would provide them with control over the 2024 electoral machinery, and the systematic advance of a Republican agenda by the Supreme Court, the underlying political question of the 2020s remains whether majority rule — and democracy as we’ve known it — can survive this offensive.</p>\n</blockquote>\n\n<p class=\"x-netnewswire-hide\" style=\"padding-top: 1.5em;\"><em>Link: <strong><a href=\"https://www.theatlantic.com/politics/archive/2022/06/red-and-blue-state-divide-is-growing-michael-podhorzer-newsletter/661377/\">theatlantic.com/politics/archive/2022/06/red-and-blue-state…</a></strong></em></p>\n"
      },
      {
         "title" : "Tailscale",
         "date_published" : "2022-06-25T22:16:49Z",
         "date_modified" : "2022-06-25T22:16:50Z",
         "id" : "https://daringfireball.net/linked/2022/06/25/tailscale",
         "url" : "https://daringfireball.net/linked/2022/06/25/tailscale",
         "external_url" : "https://www.tailscale.com/daringfireball?utm_source=df&utm_medium=RSS&utm_content=tweet",
         "authors" : [
            {
               "name" : "John Gruber"
            }
         ],
         "content_html" : "\n<p>My thanks to Tailscale for sponsoring last week at DF. Tailscale is the easiest way to create a peer-to-peer network with the power of Wireguard. SSH, VNC, RDP? All made simple with Tailscale installed.</p>\n\n<p>No additional hardware to manage. No complicated firewall rules. And completely free for personal use.</p>\n\n<p class=\"x-netnewswire-hide\" style=\"padding-top: 1.5em;\"><em>Link: <strong><a href=\"https://www.tailscale.com/daringfireball?utm_source=df&utm_medium=RSS&utm_content=tweet\">tailscale.com/daringfireball?utm_source=df&utm_medium=RSS…</a></strong></em></p>\n"
      },
      {
         "title" : "The Dissent",
         "date_published" : "2022-06-24T18:14:59Z",
         "date_modified" : "2022-06-27T17:30:24Z",
         "id" : "https://daringfireball.net/linked/2022/06/24/the-dissent",
         "url" : "https://daringfireball.net/linked/2022/06/24/the-dissent",
         "external_url" : "https://www.supremecourt.gov/opinions/21pdf/19-1392_6j37.pdf",
         "authors" : [
            {
               "name" : "John Gruber"
            }
         ],
         "content_html" : "\n<p>There’s a lot to read regarding today’s 5-4 decision by the U.S. Supreme Court to overturn <em>Roe v. Wade</em>, making official what we’ve known was about to happen since a near-final draft <a href=\"https://daringfireball.net/linked/2022/05/02/scotus-to-overturn-rue\">leaked</a> in early May. I humbly suggest starting with the dissent, written by all three dissenting justices, Breyer, Sotomayor, and Kagan. Their dissent begins on page 148 of the PDF decision.</p>\n\n<p>Some highlights. P. 3 (page 151 of PDF):</p>\n\n<blockquote>\n  <p>Most threatening of all, no language in today’s decision stops the\nFederal Government from prohibiting abortions nationwide, once\nagain from the moment of conception and without exceptions for\nrape or incest. If that happens, “the views of [an individual\nState’s] citizens” will not matter. Ante, at 1. The challenge for\na woman will be to finance a trip not to “New York [or]\nCalifornia” but to Toronto.</p>\n</blockquote>\n\n<p>P. 4:</p>\n\n<blockquote>\n  <p>The lone rationale for what the majority does today is that the\nright to elect an abortion is not “deeply rooted in history”: Not\nuntil <em>Roe</em>, the majority argues, did people think abortion fell\nwithin the Constitution’s guarantee of liberty. The same could be\nsaid, though, of most of the rights the majority claims it is not\ntampering with. The majority could write just as long an opinion\nshowing, for example, that until the mid-20th century, “there was\nno support in American law for a constitutional right to obtain\n[contraceptives].” So one of two things must be true. Either the\nmajority does not really believe in its own reasoning. Or if it\ndoes, all rights that have no history stretching back to the mid-\n19th century are insecure. Either the mass of the majority’s\nopinion is hypocrisy, or additional constitutional rights are\nunder threat. It is one or the other.</p>\n</blockquote>\n\n<p>P. 14:</p>\n\n<blockquote>\n  <p>As an initial matter, note a mistake in the just preceding\nsentence. We referred there to the “people” who ratified the\nFourteenth Amendment: What rights did those “people” have in their\nheads at the time? But, of course, “people” did not ratify the\nFourteenth Amendment. Men did. So it is perhaps not so surprising\nthat the ratifiers were not perfectly attuned to the importance of\nreproductive rights for women’s liberty, or for their capacity to\nparticipate as equal members of our Nation. Indeed, the ratifiers — both in 1868 and when the original Constitution was approved in\n1788 — did not understand women as full members of the community\nembraced by the phrase “We the People.” In 1868, the first wave of\nAmerican feminists were explicitly told — of course by men — that it was not their time to seek constitutional protections.\n(Women would not get even the vote for another half-century.) To\nbe sure, most women in 1868 also had a foreshortened view of their\nrights: If most men could not then imagine giving women control\nover their bodies, most women could not imagine having that kind\nof autonomy. But that takes away nothing from the core point.\nThose responsible for the original Constitution, including the\nFourteenth Amendment, did not perceive women as equals, and did\nnot recognize women’s rights. When the majority says that we must\nread our foundational charter as viewed at the time of\nratification (except that we may also check it against the Dark\nAges), it consigns women to second-class citizenship.</p>\n</blockquote>\n\n<p>P. 33:</p>\n\n<blockquote>\n  <p>So how does that approach prevent the “scale of justice” from\n“waver[ing] with every new judge’s opinion”? It does not. It makes\nradical change too easy and too fast, based on nothing more than\nthe new views of new judges. The majority has overruled <em>Roe</em> and\n<em>Casey</em> for one and only one reason: because it has always\ndespised them, and now it has the votes to discard them. The\nmajority thereby substitutes a rule by judges for the rule of law.</p>\n</blockquote>\n\n<p>And its poignant conclusion (p. 60):</p>\n\n<blockquote>\n  <p>One of us once said that “[i]t is not often in the law that so few\nhave so quickly changed so much.” For all of us, in our time on\nthis Court, that has never been more true than today. In\noverruling <em>Roe</em> and <em>Casey</em>, this Court betrays its guiding\nprinciples.</p>\n\n<p>With sorrow — for this Court, but more, for the many millions of\nAmerican women who have today lost a fundamental constitutional\nprotection — we dissent.</p>\n</blockquote>\n\n<p>Keep the faith.</p>\n\n<p class=\"x-netnewswire-hide\" style=\"padding-top: 1.5em;\"><em>Link: <strong><a href=\"https://www.supremecourt.gov/opinions/21pdf/19-1392_6j37.pdf\">supremecourt.gov/opinions/21pdf/19-1392_6j37.pdf</a></strong></em></p>\n"
      },
      {
         "title" : "Four Democratic Lawmakers Want the F.T.C. to Investigate Apple and Google Over Mobile Surveillance Advertising",
         "date_published" : "2022-06-24T17:48:07Z",
         "date_modified" : "2022-06-24T21:43:33Z",
         "id" : "https://daringfireball.net/linked/2022/06/24/democrats-apple-google-idfa-ftc",
         "url" : "https://daringfireball.net/linked/2022/06/24/democrats-apple-google-idfa-ftc",
         "external_url" : "https://www.wsj.com/articles/lawmakers-want-ftc-to-investigate-apple-google-over-mobile-tracking-11656077945",
         "authors" : [
            {
               "name" : "John Gruber"
            }
         ],
         "content_html" : "\n<p>Patience Haggin, reporting for The Wall Street Journal (<a href=\"https://apple.news/A1F1LaijITUe_O26OWOt6jw\">News+</a>):</p>\n\n<blockquote>\n  <p>Four Democratic lawmakers called on the Federal Trade Commission\nto investigate Apple Inc. and Alphabet Inc.’s Google, alleging the\ncompanies engage in unfair and deceptive practices by enabling the\ncollection and sale of mobile-phone users’ personal information.</p>\n\n<p>Apple and Google “knowingly facilitated these harmful practices by\nbuilding advertising-specific tracking IDs into their mobile\noperating systems,” the lawmakers wrote in a letter to FTC chair\nLina Khan sent on Friday.</p>\n</blockquote>\n\n<p>This strikes me as deeply misguided in several ways. For one thing, it doesn’t seem to acknowledge that the Identity for Advertisers (<a href=\"https://en.wikipedia.org/wiki/Identifier_for_Advertisers\">IDFA</a>) was created to replace immutable unique device IDs, which advertisers were using previously for tracking. Second, with Apple’s recent Ad-Tracking Transparency (<a href=\"https://developer.apple.com/documentation/apptrackingtransparency\">ATT</a>) initiative, which clearly has put more control over tracking into users’ hands, I don’t see why it makes any sense to lump Apple and Google together on this, other than performative virtue signaling that one is staunchly against the entire “Big Tech” boogeyman complex.</p>\n\n<blockquote>\n  <p>Both companies have recently taken steps to limit the collection\nof user data through these mobile-ad identifiers — a string of\nnumbers and letters built into iOS and Android, the respective\nmobile operating systems of Apple and Google. Users of both\noperating systems now have a way to opt out of having their\nidentifier transmitted to apps. Apple last year introduced a new\nversion of its software that requires each app to ask the user for\npermission to access the device’s identifier, and Google is\nplanning to adopt new privacy restrictions to curtail tracking\nacross apps on Android smartphones.</p>\n\n<p>“Until recently, however, Apple enabled this tracking ID by\ndefault and required consumers to dig through confusing phone\nsettings to turn it off. Google still enables this tracking\nidentifier by default, and until recently did not even provide\nconsumers with an opt-out,” said the letter, which was signed by\nSen. Ron Wyden (D., Ore.); Sen. Elizabeth Warren (D., Mass.); Sen.\nCory Booker (D., N.J.); and Rep. Sara Jacobs (D., Calif.). “These\nidentifiers have fueled the unregulated data broker market by\ncreating a single piece of information linked to a device that\ndata brokers and their customers can use to link to other data\nabout consumers.”</p>\n</blockquote>\n\n<p>So Apple has done the pro-privacy thing and made access to this identifier more clear to users, and Google intends to do similar. This, after creating IDFA in the first place to keep the ad industry from using immutable unique device identifiers for tracking. So the point of this FTC investigation would be what, exactly?</p>\n\n<p><a href=\"https://www.nytimes.com/live/2022/06/24/us/roe-wade-abortion-supreme-court\">What a fucking day</a> for four Democrats to signal that their attention is out in left field.</p>\n\n<p class=\"x-netnewswire-hide\" style=\"padding-top: 1.5em;\"><em>Link: <strong><a href=\"https://www.wsj.com/articles/lawmakers-want-ftc-to-investigate-apple-google-over-mobile-tracking-11656077945\">wsj.com/articles/lawmakers-want-ftc-to-investigate-apple…</a></strong></em></p>\n"
      },
      {
         "title" : "Marques Brownlee Previews Industrial Design of Nothing’s ‘Phone (1)’",
         "date_published" : "2022-06-24T00:07:20Z",
         "date_modified" : "2022-06-24T00:11:50Z",
         "id" : "https://daringfireball.net/linked/2022/06/23/mkbhd-nothing",
         "url" : "https://daringfireball.net/linked/2022/06/23/mkbhd-nothing",
         "external_url" : "https://www.youtube.com/watch?v=mrkAmmMakMg",
         "authors" : [
            {
               "name" : "John Gruber"
            }
         ],
         "content_html" : "\n<p>Shot: MKBHD has a nice short preview look at Nothing’s first phone, which is debuting in a few weeks. There are some aspects of its design that are clearly iPhone-inspired — the basic shape, flat sides, button shapes even. But there are other aspects that are clearly like nothing else — the clear back and light-up “glyph” interface for custom notifications while the phone is face down. I dig the Nothing aesthetic, so I was thinking maybe this might be my next Android “see how the other side lives” devices.</p>\n\n<p>Chaser: “<a href=\"https://www.pcmag.com/news/nothing-confirms-phone-1-will-not-be-coming-to-us\">Nothing Confirms Phone (1) Will Not Be Coming to US</a>”.</p>\n\n<p>So much for that idea.</p>\n\n<p class=\"x-netnewswire-hide\" style=\"padding-top: 1.5em;\"><em>Link: <strong><a href=\"https://www.youtube.com/watch?v=mrkAmmMakMg\">youtube.com/watch?v=mrkAmmMakMg</a></strong></em></p>\n"
      },
      {
         "title" : "Twenty Years of Flying Meat",
         "date_published" : "2022-06-23T23:31:10Z",
         "date_modified" : "2022-06-23T23:31:11Z",
         "id" : "https://daringfireball.net/linked/2022/06/23/flying-meat-twenty-years",
         "url" : "https://daringfireball.net/linked/2022/06/23/flying-meat-twenty-years",
         "external_url" : "https://shapeof.com/archives/2022/6/twenty_years_of_flying_meat.html",
         "authors" : [
            {
               "name" : "John Gruber"
            }
         ],
         "content_html" : "\n<p>Gus Mueller:</p>\n\n<blockquote>\n  <p>On this day twenty years ago I registered the <a href=\"https://flyingmeat.com/\">flyingmeat.com</a>\ndomain. I had no idea what I was doing back then, only that I\nloved coding, I loved sharing what I worked on, and indie\ncompanies were undisputedly cool.</p>\n\n<p>Twenty years later I still have no idea what I’m doing, but I\nstill love coding and sharing what I make, and indie companies are\nstill the best. [...]</p>\n\n<p>However I’m not going to let this opportunity pass without a\nlittle bit of fun, so I’ve put all my apps on sale for $20. Acorn?\nNormally $39.95, now $20. Retrobatch Pro? Normally $49.99, now\n$20. Retrobatch Pro Upgrade? Normally $19.99, now $20 (Yes, we\nraised the price. No, it makes no sense to purchase it).</p>\n</blockquote>\n\n<p>Here’s to 20 more years. Both Acorn and Retrobatch are indispensable to my workflows.</p>\n\n<p class=\"x-netnewswire-hide\" style=\"padding-top: 1.5em;\"><em>Link: <strong><a href=\"https://shapeof.com/archives/2022/6/twenty_years_of_flying_meat.html\">shapeof.com/archives/2022/6/twenty_years_of_flying_meat…</a></strong></em></p>\n"
      },
      {
         "title" : "Rick Olivieri, ‘Prince of Steaks’, Dies at 57",
         "date_published" : "2022-06-23T17:12:16Z",
         "date_modified" : "2022-06-23T17:12:17Z",
         "id" : "https://daringfireball.net/linked/2022/06/23/rick-olivieri",
         "url" : "https://daringfireball.net/linked/2022/06/23/rick-olivieri",
         "external_url" : "https://www.inquirer.com/obituaries/rick-olivieri-cheesesteak-obituary-20220618.html",
         "authors" : [
            {
               "name" : "John Gruber"
            }
         ],
         "content_html" : "\n<p>Sad local note. Michael Klein, writing for The Philadelphia Inquirer:</p>\n\n<blockquote>\n  <p>Rick Olivieri, 57, a grandson of cheesesteak inventor Pat Olivieri\nand the former owner of the popular Rick’s Steaks at Reading\nTerminal Market, died Sunday, June 12, at his Drexel Hill home\nafter a 10-year battle with early onset frontotemporal dementia.</p>\n\n<p>“He fought it for every minute,” said his wife, Debi, who met Mr.\nOlivieri in summer 1984, shortly after she took a job at the\nBassetts turkey stand a few aisles away from Olivieri Prince of\nSteaks, where Mr. Olivieri had worked for his father, Herb, a son\nof Pasquale “Pat” Olivieri of Pat’s King of Steaks fame. (Pat’s,\nat Ninth and Wharton Streets for 90 years, is operated by Frank\nOlivieri, his cousin.)</p>\n</blockquote>\n\n<p>Rick’s was, hands-down, the best cheesesteak I’ve ever had. First, each sandwich was grilled fresh — your steak only started grilling after you ordered. This meant lines were long at lunchtime, but the sandwiches were impeccable. Second, Rick’s used really good steak — a special cut of ribeye from a local butcher here in Philly. Third — and this is key — they were reasonably portioned. There are a lot of good cheesesteak joints here, but most of them pack way too much meat into each sandwich. Rick’s used exactly six thin slices on each sandwich — just right.</p>\n\n<p>Lastly is the fact that Rick was always there, seemingly always manning the grill himself. I ate at Rick’s dozens of times. There might have been someone else manning the grill once.</p>\n\n<p class=\"x-netnewswire-hide\" style=\"padding-top: 1.5em;\"><em>Link: <strong><a href=\"https://www.inquirer.com/obituaries/rick-olivieri-cheesesteak-obituary-20220618.html\">inquirer.com/obituaries/rick-olivieri-cheesesteak-obituary…</a></strong></em></p>\n"
      },
      {
         "title" : "★ Two New Apps I Wanted to Flag for You",
         "date_published" : "2022-06-23T15:30:05Z",
         "date_modified" : "2022-06-23T17:20:22Z",
         "id" : "https://daringfireball.net/2022/06/two_new_apps_to_flag",
         "url" : "https://daringfireball.net/2022/06/two_new_apps_to_flag",
         "authors" : [
            {
               "name" : "John Gruber"
            }
         ],
         "content_html" : "\n<p>Last week <a href=\"https://daringfireball.net/linked/2022/06/14/macos-12-input-menu-flags\">I wrote about a change in MacOS 12.4 that upset many polyglots</a> — as part of a company-wide effort to decouple national flags as icons to denote languages, the Input menu in MacOS now uses two letter codes instead (“US” for U.S. English, “GB” for British, etc.). As I wrote in an update to that post, the new policy does make sense for Apple — national flags carry political connotations that languages alone do not — but it’s unfortunate for users accustomed to scanning the menu for colorful icons at a glance when switching.</p>\n\n<p>Two third-party developers have come to the rescue, with similar apps that restore the “pick a flag to change input sources” functionality:</p>\n\n<ul>\n<li><p><a href=\"https://overdesigned.net/switcheroo/\">Keyboard Switcheroo</a> is a $2 app from Adam Overholtzer (creator of, among other utilities, the excellent <a href=\"https://overdesigned.net/incognito/\">Incognito Browser</a> for iOS). <a href=\"https://itunes.apple.com/app/id1630573891\">App Store link</a>.</p></li>\n<li><p><a href=\"https://danielkasaj.com/\">Colorful Input Menu Flags</a> is a $1 app from \nDaniel Kašaj. <a href=\"https://apps.apple.com/us/app/id1630533969\">App Store link</a>.</p></li>\n</ul>\n\n<p>Both apps serve the same fundamental purpose: they add a system-wide menu item that shows a flag icon to denote the current input language. Open the menu, and you can choose another input source language, as configured in the Keyboard panel in System Preferences.</p>\n\n<p>Keyboard Switcheroo is a bit more polished. It lets you choose between the traditional flat flags, as previously used in the system’s built-in Input menu, the emojis for those flags (which are a bit larger and wavy instead of flat), or a custom image. Colorful Input Menu Flags only uses the emoji icons. Keyboard Switcheroo also lets you edit the languages shown in the menu directly within the app — no need to go to System Preferences.</p>\n\n\n\n    "
      },
      {
         "title" : "Mail Merge Returns to Pages After Nine Years",
         "date_published" : "2022-06-22T23:43:11Z",
         "date_modified" : "2022-06-22T23:43:11Z",
         "id" : "https://daringfireball.net/linked/2022/06/22/mail-merge-pages",
         "url" : "https://daringfireball.net/linked/2022/06/22/mail-merge-pages",
         "external_url" : "https://sixcolors.com/post/2022/06/mail-merge-returns-to-pages-after-nine-years/",
         "authors" : [
            {
               "name" : "John Gruber"
            }
         ],
         "content_html" : "\n<p>Dan Moren, writing at Six Colors:</p>\n\n<blockquote>\n  <p>After almost a decade, I guess it’s time to pack in my posters,\nstickers, and Tim Cook and Craig Federighi phone call scripts for\nthe “Bring Mail Merge back to Pages!” campaign and declare\nvictory. Because, yes, Mail Merge has returned to Pages.</p>\n\n<p>The feature was originally included in Apple’s word processing\nsoftware, but got the axe in 2013’s version 5.0, when Apple\nredesigned its iWork suite to give even footing across the iOS,\niPadOS, and macOS platforms. In the interim, Mail Merge remained\npossible only via workarounds like <a href=\"https://sixcolors.com/post/2017/06/automate-this-mail-merge-with-pages-and-numbers/\">Sal Soghoian’s Pages Data\nMerge app</a>.</p>\n\n<p>Version 12.1, released today, brings a brand new implementation,\nhowever, which lets you populate a template document either from\nyour contacts or a spreadsheet.</p>\n</blockquote>\n\n<p>Two discrete thoughts on this. First, nine years is a long time, but Apple seemingly remains very committed to the iWork suite. They added some <a href=\"https://www.macrumors.com/2022/06/21/apple-iwork-updates-new-features/\">cool new features in all three apps this week</a>.</p>\n\n<p>Second, the fact that workarounds like Soghoian’s Pages Data Merge were even possible in the interim shows the essential nature of good automation/scripting support in serious apps. Automation isn’t so much about letting all users script apps, because we all know most users aren’t scripters. But automation lets the users who <em>are</em> scripters provide solutions for the whole community of users.</p>\n\n<p class=\"x-netnewswire-hide\" style=\"padding-top: 1.5em;\"><em>Link: <strong><a href=\"https://sixcolors.com/post/2022/06/mail-merge-returns-to-pages-after-nine-years/\">sixcolors.com/post/2022/06/mail-merge-returns-to-pages…</a></strong></em></p>\n"
      },
      {
         "title" : "Kottke, on Sabbatical",
         "date_published" : "2022-06-22T14:40:42Z",
         "date_modified" : "2022-06-23T00:24:27Z",
         "id" : "https://daringfireball.net/linked/2022/06/22/kottke-sabbatical",
         "url" : "https://daringfireball.net/linked/2022/06/22/kottke-sabbatical",
         "external_url" : "https://kottke.org/22/05/announcement-im-going-to-miss-you-but-i-am-taking-a-sabbatical",
         "authors" : [
            {
               "name" : "John Gruber"
            }
         ],
         "content_html" : "\n<p>Jason Kottke, six weeks ago:</p>\n\n<blockquote>\n  <p>Does what I do here make a difference in other people’s lives? In\nmy life? Is this still scratching the creative itch that it used\nto? And if not, what needs to change? Where does kottke.org end\nand Jason begin? Who am I without my work? Is the validation I get\nfrom the site healthy? Is having to be active on social media\nhealthy? Is having to read the horrible news every day healthy?\nWhat else could I be doing here? What could I be doing somewhere\nelse? What good is a blog without a thriving community of other\nblogs? I’ve tried thinking about these and many other questions\nwhile continuing my work here, but I haven’t made much progress; I\nneed time away to gain perspective.</p>\n\n<p>So. The plan, as it currently stands, is to take 5-6 months away\nfrom the site. I will not be posting anything new here. I won’t be\npublishing the newsletter. There won’t be a guest editor either — if someone else was publishing here, it would still be on my mind\nand I’m looking for total awayness here.</p>\n</blockquote>\n\n<p>Six weeks in and I miss his words dearly, but I’m happy for him. They say you should hydrate before you get thirsty. I suspect the same is true for taking sabbaticals — you should take one before you know you need one. That’s hard to figure out, though.</p>\n\n<p>A friend once asked me what’s been the longest stretch between posts on DF since I started. I told him the truth: I don’t know.</p>\n\n<p><strong>Update:</strong> Well, now I know, thanks to <a href=\"https://gist.github.com/henrik/daf6335032d768a8829d4c37cc17c793\">a nifty Ruby script</a> <a href=\"https://twitter.com/henrik/status/1539686104911253504\">from DF reader Henrik Nyh</a>. I took a 12-day break around Christmas in 2003. Since I started the Linked List (shorter link posts) in 2004, the longest gap is 8 days, from 29 December 2019 to 6 January 2020. The longest stretch between feature articles is 50 days, from 22 September to 11 November 2015.</p>\n\n<p class=\"x-netnewswire-hide\" style=\"padding-top: 1.5em;\"><em>Link: <strong><a href=\"https://kottke.org/22/05/announcement-im-going-to-miss-you-but-i-am-taking-a-sabbatical\">kottke.org/22/05/announcement-im-going-to-miss-you-but-i-am…</a></strong></em></p>\n"
      },
      {
         "title" : "iOS 16 Will Let Users Bypass Captchas in Supported Apps and Websites",
         "date_published" : "2022-06-21T21:21:30Z",
         "date_modified" : "2022-06-22T16:56:09Z",
         "id" : "https://daringfireball.net/linked/2022/06/21/captchas-ios-16",
         "url" : "https://daringfireball.net/linked/2022/06/21/captchas-ios-16",
         "external_url" : "https://www.macrumors.com/2022/06/20/ios-16-bypass-captchas/?scrolla=5eb6d68b7fedc32c19ef33b4",
         "authors" : [
            {
               "name" : "John Gruber"
            }
         ],
         "content_html" : "\n<p>Joe Rossignol, writing for MacRumors:</p>\n\n<blockquote>\n  <p>The handy new feature can be found in the Settings app under Apple ID → Password &amp; Security → Automatic Verification. When enabled, Apple says iCloud will automatically and privately verify your device and Apple ID account in the background, eliminating the need for apps and websites to present you with a CAPTCHA verification prompt.</p>\n\n<p><a href=\"https://developer.apple.com/videos/play/wwdc2022/10077/\">Apple recently shared a video</a> with technical details about how the feature works, but simply put, Apple’s system verifies that the device and Apple ID account are in good standing and presents what is called a Private Access Token to the app or website. This new system will offer a better user experience for tasks such as signing into or creating an account, with improved user privacy and accessibility compared to CAPTCHAs.</p>\n</blockquote>\n\n<p>No more unpaid work helping Google train its autonomous vehicle systems? I’ll believe it when I see it.</p>\n\n<p><strong>Update:</strong> Color me more optimistic today than yesterday: <a href=\"https://www.ietf.org/archive/id/draft-private-access-tokens-01.html\">two of the draft spec’s authors are from Google</a>, so maybe they will go all-in for this.</p>\n\n<p class=\"x-netnewswire-hide\" style=\"padding-top: 1.5em;\"><em>Link: <strong><a href=\"https://www.macrumors.com/2022/06/20/ios-16-bypass-captchas/?scrolla=5eb6d68b7fedc32c19ef33b4\">macrumors.com/2022/06/20/ios-16-bypass-captchas/?scrolla…</a></strong></em></p>\n"
      },
      {
         "title" : "Apple Will Now Allow Developers to Transfer Ownership of Apps That Use iCloud",
         "date_published" : "2022-06-20T15:31:17Z",
         "date_modified" : "2022-06-20T15:31:18Z",
         "id" : "https://daringfireball.net/linked/2022/06/20/icloud-app-transfer",
         "url" : "https://daringfireball.net/linked/2022/06/20/icloud-app-transfer",
         "external_url" : "https://www.swiftjectivec.com/icloud-app-transfers-now-allowed/",
         "authors" : [
            {
               "name" : "John Gruber"
            }
         ],
         "content_html" : "\n<p>Jordan Morgan:</p>\n\n<blockquote>\n  <p>The most impactful change to come out of W.W.D.C. had nothing to\ndo with APIs, a new framework or any hardware announcement.\nInstead, it was a change I’ve been clamoring for the last several\nyears - and it’s one that’s incredibly indie friendly. As you’ve\nno doubt heard by now, I’m of course talking about <a href=\"https://developer.apple.com/news/releases/?id=06152022a\">iCloud enabled\napps now allowing app transfers</a>. [...]</p>\n\n<p>When my last app, Spend Stack, was <a href=\"https://swiftjectivec.com/A-New-Home-For-Spend-Stack/\">acquired</a> — it took nearly\n<em>four months</em> to get settled. This was an experienced buyer who\nusually had things done and dusted in one week. Why did it take so\nlong? Because I didn’t just sell Spend Stack, I had to sell my\nentire LLC, Dreaming In Binary, which I had owned for many years\nto that point. Instead of transferring the app, I had to manage a\nslew of logistical hurdles that neither I, or the acquirer, wanted\nto otherwise.</p>\n</blockquote>\n\n<p>This one might deserve a non-sarcastic <em>finally</em>.</p>\n\n<p class=\"x-netnewswire-hide\" style=\"padding-top: 1.5em;\"><em>Link: <strong><a href=\"https://www.swiftjectivec.com/icloud-app-transfers-now-allowed/\">swiftjectivec.com/icloud-app-transfers-now-allowed/</a></strong></em></p>\n"
      },
      {
         "title" : "BuzzFeed News: Leaked Audio Shows U.S. TikTok User Data Has Been Repeatedly Accessed From China",
         "date_published" : "2022-06-20T14:37:57Z",
         "date_modified" : "2022-06-20T16:28:53Z",
         "id" : "https://daringfireball.net/linked/2022/06/20/buzzfeed-tiktok-china",
         "url" : "https://daringfireball.net/linked/2022/06/20/buzzfeed-tiktok-china",
         "external_url" : "https://www.buzzfeednews.com/article/emilybakerwhite/tiktok-tapes-us-user-data-china-bytedance-access",
         "authors" : [
            {
               "name" : "John Gruber"
            }
         ],
         "content_html" : "\n<p>Emily Baker-White, reporting for BuzzFeed News:</p>\n\n<blockquote>\n  <p>For years, TikTok has <a href=\"https://newsroom.tiktok.com/en-us/statement-on-tiktoks-content-moderation-and-data-security-practices\">responded</a> to data privacy concerns by\npromising that information gathered about users in the United\nStates is stored in the United States, rather than China, where\nByteDance, the video platform’s parent company, is located. But\naccording to leaked audio from more than 80 internal TikTok\nmeetings, China-based employees of ByteDance have repeatedly\naccessed nonpublic data about US TikTok users — exactly the type\nof behavior that inspired former president Donald Trump to\nthreaten to ban the app in the United States.</p>\n\n<p>The recordings, which were reviewed by BuzzFeed News, contain 14\nstatements from nine different TikTok employees indicating that\nengineers in China had access to US data between September 2021\nand January 2022, at the very least. Despite a TikTok executive’s\nsworn <a href=\"https://www.youtube.com/watch?v=HnH6HuFU6hI\">testimony</a> in an October 2021 Senate hearing that a\n“world-renowned, US-based security team” decides who gets access\nto this data, nine statements by eight different employees\ndescribe situations where US employees had to turn to their\ncolleagues in China to determine how US user data was flowing. US\nstaff did not have permission or knowledge of how to access the\ndata on their own, according to the tapes.</p>\n</blockquote>\n\n<p>Like the proverbial stopped clock being right twice a day, the Trump administration was right on this one. TikTok should have been — and still should be — banned in the U.S. unless and until ByteDance sells the whole thing to a western company. It’s as bonkers today to let China run a popular media service as it would have been to allow the Soviet Union to run a U.S. TV network during the Cold War.</p>\n\n<p class=\"x-netnewswire-hide\" style=\"padding-top: 1.5em;\"><em>Link: <strong><a href=\"https://www.buzzfeednews.com/article/emilybakerwhite/tiktok-tapes-us-user-data-china-bytedance-access\">buzzfeednews.com/article/emilybakerwhite/tiktok-tapes-us…</a></strong></em></p>\n"
      },
      {
         "title" : "★ German Regulators Open Investigation Into Apple’s App Tracking Transparency",
         "date_published" : "2022-06-14T19:47:57Z",
         "date_modified" : "2022-06-14T20:48:01Z",
         "id" : "https://daringfireball.net/2022/06/germany_app_tracking_transparency",
         "url" : "https://daringfireball.net/2022/06/germany_app_tracking_transparency",
         "authors" : [
            {
               "name" : "John Gruber"
            }
         ],
         "content_html" : "\n<p>From a <a href=\"https://www.bundeskartellamt.de/SharedDocs/Publikation/EN/Pressemitteilungen/2022/14_06_2022_Apple.pdf?__blob=publicationFile&amp;v=3\">PDF press release (in English) from Germany’s Bundeskartellamt (“Federal Cartel Office”)</a>:</p>\n\n<blockquote>\n  <p>The Bundeskartellamt has initiated a proceeding against the\ntechnology company Apple to review under competition law its\ntracking rules and the App Tracking Transparency Framework. In\nparticular, Apple’s rules have raised the initial suspicion of\nself-preferencing and/or impediment of other companies, which will\nbe examined in the proceeding.</p>\n\n<p>Apple introduced the App Tracking Transparency Framework for\nthird-party apps with its updates iOS 14.5, iPadOS 14.5 and tvOS\n14.5 in April 2021. It establishes certain preconditions for user\ntracking as defined by Apple by third-party apps. Advertisers or\napp publishers, for example, can use tracking to display targeted\nadvertising on websites and apps or to track and use user data for\nother purposes. These options can be particularly relevant to\nproviders of third-party apps in case their business models rely\non apps which are available free of charge, but financed through\nadvertising.</p>\n</blockquote>\n\n<p>Keep in mind that in Germany, big publishing companies like Axel Springer <a href=\"https://daringfireball.net/linked/2022/01/25/german-publishers-wah-wah\">are pushing back against Google’s stated plans to remove third-party cookie support from Chrome</a>. The notion that if a company has built a business model on top of privacy-invasive surveillance advertising, they have a right to continue doing so, seems to have taken particular root in Germany.</p>\n\n<p>I’ll go back to my analogy: it’s like pawn shops suing to keep the police from cracking down on a wave of burglaries.</p>\n\n<p>Back to the Bundeskartellamt (boldface added):</p>\n\n<blockquote>\n  <p>Andreas Mundt, President of the Bundeskartellamt: “We welcome\nbusiness models which use data carefully and give users choice as\nto how their data are used. A corporation like Apple which is in a\nposition to unilaterally set rules for its ecosystem, in\nparticular for its app store, should make pro-competitive rules.\nWe have reason to doubt that this is the case when we see that\nApple’s rules apply to third parties, <b>but not to Apple\nitself</b>. This would allow Apple to give preference to its own\noffers or impede other companies. Our proceeding is largely based\non the new competencies we received as part of the stricter abuse\ncontrol rules regarding large digital companies which were\nintroduced last year (Section 19a German Competition Act - GWB).\nOn this basis, we are conducting or have already concluded\nproceedings against Google/Alphabet, Meta/Facebook and Amazon.”</p>\n</blockquote>\n\n<p>I think this is a profound misunderstanding of what Apple is doing, and how Apple is benefiting <em>indirectly</em> from ATT. Apple’s privacy and tracking rules do apply to itself. Apple’s own apps don’t show the track-you-across-other-apps permission alert not because Apple has exempted itself but because Apple’s own apps <em>don’t track you across other apps</em>. Apple’s own apps <a href=\"https://apps.apple.com/us/app/keynote/id409183694?mt=12\">show privacy report cards</a> in the App Store, too.</p>\n\n<p>Apple’s own advertising offerings — Search Ads — have indeed <a href=\"https://appleinsider.com/articles/21/10/17/apple-search-ads-grows-during-app-tracking-transparency-push\">grown significantly post-ATT</a>, but that’s not proof of self-serving. It’s at least plausible that the basic gist of what’s going on is something like this:</p>\n\n<ul>\n<li>Pre-ATT, ad spending was heavily steered toward privacy-invasive surveillance ads. Centuries of pre-internet advertising prove that tracking isn’t necessary for advertising to work, but no one is arguing that tracking isn’t effective.</li>\n<li>Apple has never engaged in the sort of tracking that ATT addresses.</li>\n<li>Post-ATT, <a href=\"https://9to5mac.com/2022/04/14/number-of-users-opting-in-to-app-tracking-on-ios-grows-significantly-since-last-year/\">it appears that somewhere around 70-75 percent of iOS users opt <em>out</em> of tracking</a>. That is to say, they <em>ask</em> not to be tracked on an app-by-app basis or turn on the system setting that disallows apps from even asking to allow tracking.</li>\n<li>In this new world where around three out of every four iOS users ask not to be tracked, non-tracking ad platforms benefit — including Apple’s own Search Ads.</li>\n</ul>\n\n<p>If you want to argue that Apple engaged in this entire ATT endeavor to benefit its own Search Ads platform, that’s plausible too. But if Apple actually cared more about maximizing Search Ads revenue than it does user privacy, wouldn’t they have just engaged in actual user tracking? The Bundeskartellamt perspective here completely disregards the idea that surveillance advertising is inherently unethical and Apple has studiously avoided it for that reason, despite the fact that it has proven to be wildly profitable for large platforms.</p>\n\n<p>Apple could have made an <em>enormous</em> amount of money selling privacy-invasive ads on iOS, but opted not to. Instead they developed a series of complex technologies, some of which incur substantial costs (e.g. <a href=\"https://support.apple.com/en-us/HT212614\">iCloud Private Relay</a>), and took on both Facebook and Google to change the industry in a way which generates much less advertising revenue than Apple would have earned by just joining in on the surveillance advertising party.</p>\n\n<p>I’d go so far as to describe the fundamental foundation of the surveillance ad industry as <em>cheating</em>. App Tracking Transparency has effectively cut down on cheating, and thus, all ad platforms that have never engaged in cheating have benefitted. ATT hasn’t completely levelled the playing field, but it’s moved the field closer to level than it was before. The heretofore cheaters are griping that their advantage has been taken away.<sup id=\"fnr1-2022-06-14-de\"><a href=\"#fn1-2022-06-14-de\">1</a></sup></p>\n\n<div class=\"footnotes\">\n<hr />\n<ol>\n<li id=\"fn1-2022-06-14-de\">\n<p>Germany, of course, is familiar with <a href=\"https://www.pbs.org/wnet/secrets/the-state-sponsored-doping-program/52/\">the competitive advantages systematic cheating can accrue</a>.&nbsp;<a href=\"#fnr1-2022-06-14-de\"  class=\"footnoteBackLink\"  title=\"Jump back to footnote 1 in the text.\">&#x21A9;&#xFE0E;</a></p>\n</li>\n</ol>\n</div>\n\n\n\n    "
      },
      {
         "title" : "★ The Talk Show Live From WWDC 2022, With Craig Federighi and Greg Joswiak",
         "date_published" : "2022-06-10T13:41:00Z",
         "date_modified" : "2022-06-10T14:03:14Z",
         "id" : "https://daringfireball.net/2022/06/the_talk_show_live_from_wwdc_2022",
         "url" : "https://daringfireball.net/2022/06/the_talk_show_live_from_wwdc_2022",
         "authors" : [
            {
               "name" : "John Gruber"
            }
         ],
         "content_html" : "\n<p>Special guests Craig Federighi and Greg Joswiak join me to discuss the news from WWDC 2022, in front of a live audience at the new Apple Developer Center at Apple Park.</p>\n\n<p><iframe width=\"480\" height=\"270\" src=\"https://www.youtube.com/embed/WfnvsepVJC0\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe></p>\n\n<p>Brought to you by:</p>\n\n<ul>\n<li><a href=\"https://macstadium.com/thetalkshow\">MacStadium</a>: Private Mac clouds built by developers, for developers.</li>\n<li><a href=\"https://atoms.com/df\">Atoms</a>: The ideal everyday shoe.</li>\n</ul>\n\n<p>Watch it on the biggest screen you can — this is the first time the show was mastered and available in 4K. My sincere thanks to everyone at Apple who helped make this happen. Extra special thanks to my friends at <a href=\"https://sandwich.co/\">Sandwich</a>, once again, for their remarkable work producing the video — what a joy it is to work with them.</p>\n\n\n\n    "
      }
   ]
}
