{
  "version" : "https://jsonfeed.org/version/1",
  "title" : "kottke.org",
  "home_page_url" : "http://kottke.org",
  "feed_url" : "http://feeds.kottke.org/json",
  "description" : "Something interesting everyday from one of the oldest and best independent sites on the Web.",
  "author" : {
     "url" : "https://twitter.com/jkottke",
     "name" : "Jason Kottke" 
  },
  "icon" : "http://kottke.org/images/2016/ios/940x940.png",
  "favicon" : "http://kottke.org/images/2016/ios/76x76.png",
  "items" : [
    {
      "title" : "Announcement: I&#8217;m Going to Miss You, But I Am Taking a Sabbatical",
      "date_published" : "2022-05-09T14:10:34Z",
      "id" : "tag:kottke.org,2022://5.41182",
      "url" : "https://kottke.org/22/05/announcement-im-going-to-miss-you-but-i-am-taking-a-sabbatical",
      "author" : {
         "name" : "Jason Kottke" 
      },
      "content_html" : "<p>Hello, everyone. I&#8217;m going to be taking an extended break from kottke.org, starting today.  I&#8217;ve been writing here for more than <a href=\"https://kottke.org/22/03/24-years\">24 years</a>, <em>nearly half my life</em> &#8212; I need a breather. This is something I have been thinking about and planning for years<sup id=\"fnref:1651783490\"><a href=\"#fn:1651783490\" rel=\"footnote\">1</a></sup> and I&#8217;d like to share why I&#8217;m doing it, how it&#8217;s going to work, what I hope to accomplish, and how you can help.</p><p>This is a long post and was a hard one to write &#8212; I hope you&#8217;ll give it your thoughtful attention. But first, let me introduce you to my plant.</p><p>(This is going somewhere. Trust me.)</p><p>Eight years ago when I still lived in NYC, I bought a fiddle leaf fig tree from a store in the Flower District. Here it is a couple of years ago, thriving next to my desk here in Vermont:</p><p><img src=\"/plus/misc/images/home-office.jpg\" width=\"1000\" height=\"1000\" border=\"0\" alt=\"overhead view of my home office with a fiddle leaf fig tree\" /></p><p>I&#8217;d recently moved into my own apartment after separating from my wife and figured a large plant in my new place would add some liveliness to a new beginning that was feeling overwhelming, lonely, and sad. For the first couple of months, I didn&#8217;t know if my tree and I were going to make it. I&#8217;d never really had a plant before and struggled getting a handle on the watering schedule and other plant care routines. It started losing leaves. Like, an alarming number of leaves.</p><p>I&#8217;d brought this glorious living thing into my house only to kill it! Not cool. With the stress of the separation, my new living situation, and not seeing my kids every day, I felt a little like I was dying too.</p><p>One day, I decided I was not going to let my fiddle leaf fig tree die&#8230;and if I could do that, I wasn&#8217;t going to fall apart either. It&#8217;s a little corny, but my mantra became &#8220;if my tree is ok, I am ok&#8221;. I learned how to water & feed it and figured out the best place to put it for the right amount of light. It stopped shedding leaves.</p><p>The fig tree was a happy plant for several years after that. And I was ok because my plant was ok &#8212; I found new routines and rhythms in my altered life, made new traditions with my kids, got divorced, met new people, moved to a new state (w/ my family and tree), rediscovered who I was as a person, and, wonderfully and unexpectedly, forged a supportive and rewarding parenting partnership and friendship with my ex. We made it through that tough time together, that plant and me.</p><p>Recently however, my fiddle leaf fig has been struggling again. It&#8217;s been losing leaves and has become lopsided &#8212; some branches are going gangbusters while others are almost bare and the plant is listing so badly to one side that the whole thing tips over without the weight of water in the pot. This is what it&#8217;s looking like these days:</p><p><img src=\"/plus/misc/images/fiddle-leaf-fig-lean.jpg\" width=\"1000\" height=\"1178\" border=\"0\" alt=\"a majestic fiddle leaf fig tree leans precariously to one side in a bedroom\" /></p><p>My plant is not ok. And neither am I &#8212; I feel as off-balance as my tree looks. I&#8217;m burrrrned out. I have been for a few years now. I&#8217;ve been trying to power through it, but if you&#8217;ve read anything about burnout, you know that approach doesn&#8217;t work.</p><p>I appreciate <em>so much</em> what I&#8217;ve built here at kottke.org &#8212; I get to read and learn about all sorts of new things every day, create new ideas and connections for people, and think in public &#8212; and I feel incredibly lucky to be able to set my own schedule, be my own boss, and provide for my family. But if you were to go back into the archive for the past several months and read the site closely, you&#8217;d see that I&#8217;ve been struggling.</p><p>Does what I do here make a difference in other people&#8217;s lives? In <em>my</em> life? Is this still scratching the creative itch that it used to? And if not, what needs to change? Where does kottke.org end and Jason begin? Who am I without my work? Is the validation I get from the site healthy? Is having to be active on social media healthy? Is having to read the horrible news every day healthy? What else could I be doing here? What could I be doing somewhere else? What good is a blog without a thriving community of other blogs? I&#8217;ve tried thinking about these and many other questions while continuing my work here, but I haven&#8217;t made much progress; I need time away to gain perspective.</p><p style=\"color:#999999;text-align:center;\">&middot; &middot; &middot;</p><p>So. The plan, as it currently stands, is to take 5-6 months away from the site. I will not be posting anything new here.  I won&#8217;t be publishing the newsletter. There won&#8217;t be a guest editor either &#8212; if someone else was publishing here, it would still be on my mind and I&#8217;m looking for total awayness here. I&#8217;m planning on setting up a system to republish some timeless posts from the archive while I&#8217;m away, but that&#8217;s not fully in place yet. If you send me email (<a href=\"mailto:jason@kottke.org?subject=kottke.org feedback\">please do!</a>), it might take me awhile to read it and even longer to reply &#8212; I plan to ignore my inbox as much as I can get away with. I probably won&#8217;t be on Twitter but will be more active <a href=\"https://www.instagram.com/jkottke/\">on Instagram</a> if you want to follow me there.</p><p>The goal of my time away from the site is resting, resetting, recharging, and figuring out what to do going forward. In <a href=\"https://www.nytimes.com/interactive/2022/04/21/t-magazine/culture-issue-creative-life-artists.html\">this NY Times feature</a>, <a href=\"http://www.alexandrabell.com/\">Alexandra Bell</a> said this about how art is made: &#8220;I need some space to think and live and have generative conversations and do things, and then I&#8217;ll make something, but I can&#8217;t tell you what it is just yet.&#8221; That&#8217;s the sort of energy I need to tap into for a few months.</p><p>Here&#8217;s the way I&#8217;ve been thinking about it: there&#8217;s a passenger ferry that goes from Cape Cod to Nantucket and there&#8217;s a stretch of time in the middle of the journey where you can&#8217;t see the mainland behind you and can&#8217;t yet see the island ahead &#8212; you&#8217;re just out in the open water. That&#8217;s what I need, to be in that middle part &#8212; to forget about what I&#8217;ve been doing here for so many years without having to think about where I&#8217;m going in the future. I need open water and 5-6 months feels like the right amount of time to find it.</p><p style=\"color:#999999;text-align:center;\">&middot; &middot; &middot;</p><p>This is probably a good time to admit that I&#8217;m a little terrified about taking this time off. There&#8217;s no real roadmap for this, no blueprint for independent creators taking sabbaticals to recharge. The US doesn&#8217;t have the social safety net necessary to enable extended breaks from work (or much of anything else, including health care) for people with <a href=\"https://kottke.org/20/03/weird-internet-careers\">Weird Internet Careers</a>. I support a lot of individual writers, artists, YouTubers, and bloggers through Substack, Patreon, and other channels, and over the years I&#8217;ve seen some of them produce content at a furious pace to keep up their momentum, only to burn out and quit doing the projects that I, and loads of other people, loved. With so many more people pursuing independent work funded directly by readers & viewers these days, this is something all of us, creators and supporters alike, are going to have to think about.</p><p>I&#8217;ve said this many times over the past 5 years: kottke.org would not be possible today without <a href=\"https://kottke.org/21/11/its-membership-time\">the incredible membership support</a> I have gotten from the people who read this site. Members have enabled this site to be free for everyone to read, enriching the open web and bucking the trend towards paywalling information online. I hope you will continue to support me in taking this necessary time off.</p><p>If, for whatever reason, you would like to pause/suspend your membership until I return, <a href=\"mailto:jason@kottke.org?subject=kottke.org memberships\">email me</a> and I would be happy to do that for you. You&#8217;re also free of course to <a href=\"https://kottke.org/members\">raise or lower your membership support here</a> if you&#8217;d like. Regardless of what you choose to do, I hope I will see you back here in the fall.</p><p style=\"color:#999999;text-align:center;\">&middot; &middot; &middot;</p><p>If you&#8217;re curious about what&#8217;s on my agenda for the next few months, so am I! I&#8217;m leaving on a long-planned family trip soon, but other than that, I do not have any set plans. <a href=\"mailto:jason@kottke.org?subject=kottke.org feedback\">Suggestions and advice are welcome!</a> I&#8217;d like to spend some unrushed time with my kids, who too often see me when I&#8217;m stressed out about work. I want to read more books. Watch more good movies. Take more photos. Go on pointless adventures. I want to exercise a little more regularly and figure out how to eat a bit better. Maybe travel some, visit friends or the ocean or both. Bike more. Stare at the walls. I hope to get a little bored. I need to tend to my fiddle leaf fig tree &#8212; if my tree is ok, I will be too.</p><p>I&#8217;m going to miss this &#8212; and all of you &#8212; more than I probably realize right now, but I&#8217;m ready for a break. I&#8217;ll see you in a few months.</p><p><em>*deep breath*</em></p><p>Here I go!</p><p><em>*jumps*</em></p><p style=\"color:#999999;text-align:center;\">&middot; &middot; &middot;</p><p>P.S. The best way to keep tabs on when the site starts up again is to <a href=\"https://kottke.org/newsletter/\">subscribe to the newsletter</a>. You can also <a href=\"https://twitter.com/kottke\">follow @kottke on Twitter</a>, <a href=\"http://feeds.kottke.org/main\">subscribe to the RSS feed</a>, or <a href=\"https://www.instagram.com/jkottke/\">follow me on Instagram</a> so you don&#8217;t miss anything.</p><p>P.P.S. Big big thanks to the many people I&#8217;ve talked to about this over the past few months and years, especially <a href=\"https://anildash.com/\">Anil</a>, <a href=\"https://twitter.com/alainabrowne\">Alaina</a>, <a href=\"https://hello.typepad.com/\">David</a>, <a href=\"https://twitter.com/ladymacabea\">Adriana</a>, <a href=\"https://twitter.com/tcarmody\">Tim</a>, <a href=\"https://twitter.com/gambellcaroline\">Caroline</a>, <a href=\"https://a.wholelottanothing.org/\">Matt</a>, <a href=\"https://cupofjo.com/\">Joanna</a>, <a href=\"https://megnut.com/\">Meg</a>, <a href=\"https://icecreamgracies.com/\">Aaron</a>, <a href=\"https://drawinglinks.substack.com/\">Edith</a>, Kara, Megan, Anna, <a href=\"https://www.jacksonbird.cool/\">Jackson</a>, and Michelle. (Forgive me if I&#8217;ve forgotten anyone.) I value your wise counsel and your pointing me, hopefully, in the right direction.</p><p>P.P.P.S. A quick blogroll if you&#8217;re looking for sites and newsletters to keep you busy while I&#8217;m gone. In no particular order, a non-exhaustive list: <a href=\"https://thekidshouldseethis.com/\">The Kid Should See This</a>, <a href=\"https://themorningnews.org/\">The Morning News</a>, <a href=\"https://waxy.org/\">Waxy</a>, <a href=\"https://www.thisiscolossal.com/\">Colossal</a>, <a href=\"https://jodiettenberg.substack.com/\">Curious About Everything</a>, <a href=\"https://www.openculture.com/\">Open Culture</a>, <a href=\"https://drawinglinks.substack.com/\">Drawing Links</a>, <a href=\"https://clivethompson.medium.com/\">Clive Thompson @ Medium</a>, <a href=\"https://cupofjo.com/\">Cup of Jo</a>, <a href=\"https://www.swiss-miss.com/\">swissmiss</a>, <a href=\"https://us7.campaign-archive.com/home/?u=ac3c63206e0226f0b2c43f01d&amp;id=b73fda1119\">Storythings</a>, <a href=\"http://www.thingsmagazine.net/\">things magazine</a>, <a href=\"http://blog.presentandcorrect.com/\">Present & Correct</a>, <a href=\"https://www.spoon-tamago.com/\">Spoon & Tamago</a>, <a href=\"https://www.densediscovery.com/\">Dense Discovery</a>, <a href=\"https://austinkleon.com/\">Austin Kleon</a>, <a href=\"https://nextdraft.com/\">NextDraft</a>, <a href=\"https://www.nytimes.com/newsletters/tressie-mcmillan-cottom\">Tressie McMillan Cottom</a>, <a href=\"https://www.instagram.com/poetryisnotaluxury/\">Poetry Is Not a Luxury</a>, <a href=\"https://www.athingortwohq.com/newsletter\">A Thing or Two</a>, <a href=\"https://tedgioia.substack.com/\">The Honest Broker</a>, <a href=\"https://interconnected.org/home/\">Interconnected</a>, <a href=\"https://thewhippet.org/\">The Whippet</a>, <a href=\"https://craigmod.com/\">Craig Mod</a>, <a href=\"https://whyisthisinteresting.substack.com/\">Why is this interesting?</a>, <a href=\"https://sidebar.io/\">Sidebar</a>, <a href=\"https://theprepared.org/\">The Prepared</a>, <a href=\"https://www.soverybeautiful.org/\">Life Is So Beautiful</a>, <a href=\"https://ericmaierson.substack.com/\">Fave 5</a>, <a href=\"https://sentiers.media/\">Sentiers</a>, <a href=\"https://www.thefoxisblack.com/\">The Fox Is Black</a>, and <a href=\"https://hiutdenim.co.uk/pages/newsletter\">Scrapbook Chronicles</a>. Happy hunting!</p><p><strong title=\"May 10, 2022\">Update:</strong> Hello, everyone. I want to thank you all so much for your emails, tweets, and DMs&#8230;yesterday was just a little overwhelming. I was apprehensive yesterday morning about publishing this post &#8212; I had no idea what the reaction was going to be &#8212; and, well, you folks turned it into a party. I&#8217;m so grateful for your support, advice, well-wishes, and understanding. I should not have doubted you &#8212; if this site is anything, it&#8217;s that way because of all of you. Thank you again for the support and I will see you in a few months. <span style=\"color:#cc0000;\">&#x2764;</span></p><ol><li class=\"footnote\" id=\"fn:1651783490\"><p>The original plan was to do this in late spring 2020 but&#8230;.you know.<a href=\"#fnref:1651783490\" title=\"return to article\">&#x21A9;</a></p></li></ol>"
    },
    
{
      "title" : "My Recent Media Diet, Spring 2022 Edition",
      "date_published" : "2022-05-07T15:12:14Z",
      "id" : "tag:kottke.org,2022://5.41180",
      "url" : "https://kottke.org/22/05/my-recent-media-diet-spring-2022-edition",
      "author" : {
         "name" : "Jason Kottke" 
      },
      "content_html" : "<p>Well hey there, it&#8217;s been a few months, so it&#8217;s time for another roundup of what I&#8217;ve been reading, watching, listening to, and experiencing recently. In addition to the stuff below, I have a few things in progress: the second season of <a href=\"https://www.netflix.com/title/80211627\">Russian Doll</a>, Oliver Burkeman&#8217;s <a href=\"https://bookshop.org/a/2966/9780374159122\">Four Thousand Weeks</a>, and I just started dipping into Rebecca Woolf&#8217;s forthcoming memoir, <a href=\"https://bookshop.org/a/2966/9780063052673\">All of This</a>. Oh, and I&#8217;m listening to Russell Shorto&#8217;s <a href=\"https://bookshop.org/a/2966/9781400078677\">The Island at the Center of the World</a> on <a href=\"https://libro.fm/audiobooks/9781524733742\">audiobook</a> and the third season of Michael Lewis&#8217; <a href=\"https://www.pushkin.fm/show/against-the-rules-with-michael-lewis/\">Against the Rules podcast</a>. All always, don&#8217;t sweat the letter grades too much.</p><p><iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/wxN1T1uxQ2g\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe></p><p><a href=\"https://a24films.com/films/everything-everywhere-all-at-once\">Everything Everywhere All at Once</a>. This movie is a little bit of a miracle: action, comedy, heartfelt, and a little bit of a mess, all together in a perfect balance. This is the best movie I&#8217;ve seen in ages. (A+)</p><p><a href=\"https://movies.disney.com/encanto\">Encanto</a>. The kids and I liked it fine. (B+)</p><p><a href=\"https://www.amazon.com/exec/obidos/ASIN/B09LGJ5QNB/ref=nosim/0sil8\">The Expanse (season six)</a>. I&#8217;m going to miss spending time in this world with these people. (A-)</p><p><a href=\"https://bookshop.org/a/2966/9781594634499\">Matrix</a> by Lauren Groff. Was delighted and moved by this work of historical fiction about Marie de France. (A)</p><p><iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/LPm52rq8CZA\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe></p><p><a href=\"https://www.hbomax.com/series/urn:hbo:series:GYZWoOQ6F9cLDCAEAAABP\">Station Eleven</a>. I loved the slow burn and resolution of this show. I didn&#8217;t think I wanted to watch a TV show about a flu pandemic causing the end of civilization, but it was actually perfect. Both actresses who played Kirsten were fantastic. (A/A+)</p><p><a href=\"https://www.20thcenturystudios.com/movies/the-last-duel\">The Last Duel</a>. Every director is entitled to their Rashomon I guess? And I&#8217;m not sure Matt Damon was the right choice here&#8230; (B)</p><p><a href=\"https://neonrated.com/films/pig\">Pig</a>. Had no idea what to expect from this one. Even so, Taken + Truffle Hunters + Fight Club + Ratatouille was a surprise. (B+)</p><p><a href=\"https://straffordcreamery.com/\">Strafford ice cream</a>. This Black-owned dairy farm makes the richest, creamiest ice cream I&#8217;ve ever had. So glad I randomly bought a pint of it a few months ago&#8230;I&#8217;m never going back to anything else. (A)</p><p><a href=\"https://tv.apple.com/us/show/severance/umc.cmc.1srk2goyh2q2zdxcx605w8vtx\">Severance</a>. Fantastic <a href=\"https://kottke.org/22/03/the-unskippable-opening-credits-for-severance\">opening credits sequence</a> and while I wasn&#8217;t as enamored as many were after the first few episodes, the show definitely grew on me. (A-)</p><p><a href=\"https://www.hbo.com/my-brilliant-friend\">My Brilliant Friend (season three)</a>. I don&#8217;t know why there&#8217;s no more buzz about this show. The acting, world-building, story, and Max Richter&#8217;s soundtrack are all fantastic. And the fight against fascism! (A)</p><p><a href=\"https://www.hbo.com/the-gilded-age\">The Gilded Age</a>. Exactly what I wanted out of a period drama from the maker of Downton Abbey and Gosford Park. (B+)</p><p><a href=\"https://libro.fm/audiobooks/9781984844453\">Exhalation</a>. Second time through, this time on audiobook. I love these stories - Chiang is a genius. (A)</p><p><a href=\"https://disneyplusoriginals.disney.com/show/the-book-of-boba-fett\">The Book of Boba Fett</a>. This turned into season 2.5 of The Mandalorian and I am totally ok with that. (B+)</p><p><a href=\"https://podcasts.apple.com/us/podcast/introducing-other-peoples-money-a-liars-poker-companion/id1455379351?i=1000549078945\">Other People&#8217;s Money podcast</a>. As a snack-sized in-between season for his excellent Against the Rules podcast, Michael Lewis revisits his first book, <a href=\"https://bookshop.org/a/2966/9780393338690\">Liar&#8217;s Poker</a>, written about his experience working for Salomon Brothers in the 80s. (A-)</p><p><a href=\"https://www.20thcenturystudios.com/movies/the-kings-man\">The King&#8217;s Man</a>. Not as fun as the first movie but more fun than the second one? But they all could be better. (B)</p><p><a href=\"https://www.pixar.com/turning-red\">Turning Red</a>. I loved Domee Shi&#8217;s short film, <a href=\"https://www.pixar.com/bao\">Bao</a>, and this film is similarly clever and heartfelt. (A-)</p><p><iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/6BPKPb_RTwI\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe></p><p><a href=\"https://drivemycar.film/\">Drive My Car</a>. Really appreciated the cinematography of this one; wish I could have seen it in the theater. (A-)</p><p><a href=\"https://whitney.org/exhibitions/jennifer-packer\">Jennifer Packer at The Whitney</a>. I was unfamiliar with Packer&#8217;s work before seeing this exhibition, but I&#8217;m a fan now. (A-)</p><p><a href=\"https://www.unitedartistsreleasing.com/licorice-pizza/\">Licorice Pizza</a>. I&#8217;m really flabbergasted at the two pointless racist scenes in this film. PT Anderson is a better filmmaker than this. It&#8217;s a shame because I enjoyed the rest of the film &#8212; the two leads are great. Can&#8217;t recommend it though. (D) </p><p><a href=\"https://www.20thcenturystudios.com/movies/death-on-the-nile\">Death on the Nile</a>. These movies are fun. Sometimes all you want to do is watch Kenneth Branagh chew scenery as Hercule Poirot. (B+)</p><p><a href=\"https://moonfall.movie/\">Moonfall</a>. Not as fun or coherent (I know, lol) as some of Emmerich&#8217;s other movies. The acting in this is&#8230;not great. (C+)</p><p><a href=\"https://disneyplusoriginals.disney.com/show/hawkeye\">Hawkeye</a>. Fun but I don&#8217;t know how many more Marvel things I want to keep up with. (B)</p><p><a href=\"https://www.spidermannowayhome.movie/\">Spider-Man: No Way Home</a>. Tom Holland&#8217;s Spider-Man is always fun. (B+)</p><p><a href=\"https://www.fantasticbeasts.com/\">Fantastic Beasts: The Secrets of Dumbledore</a>. Better than the overcomplicated sequel and Mikkelsen was a better Grindelwald than Depp. The story wrapped up so nicely that who knows if there will be a fourth movie. (B)</p><p><iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/HM3hsVrBMA4\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe></p><p><a href=\"https://a24films.com/films/the-tragedy-of-macbeth\">The Tragedy of Macbeth</a>. Brilliant cinematography and set design. (B+)</p><p><a href=\"https://www.thebatman.com/\">The Batman</a>. Oh I don&#8217;t know. I guess this was a pretty decent detective story, but I&#8217;m not sure why Batman needed to be involved. (B)</p><p><a href=\"https://www.focusfeatures.com/the-northman\">The Northman</a>. This would have been much better had it ended 20 minutes sooner. Not sure we needed another movie that concludes with ultimately pointless violent masculine revenge. (B-)</p><p><a href=\"https://www.hbomax.com/kimi\">Kimi</a>. Soderbergh does Rear Window + The Conversation. The direction is always tight and Zo&euml; Kravitz is great in this. (A-)</p><p><a href=\"https://www.disneyplus.com/series/the-mysterious-benedict-society/5HfolGRtUHpv\">The Mysterious Benedict Society</a>. The kids and I enjoyed this solid adaptation of the first book of a popular series. (B+)</p><p><a href=\"https://www.imdb.com/title/tt0120591/\">Armageddon</a>. The pace of this movie is incredible &#8212; it just drops you right into the action and never stops for more than 2 hours. Also, the top question when searching this movie title on Google is &#8220;Is Armageddon movie a true story?&#8221; *sigh* (B-)</p><p>Past installments of my media diet <a href=\"https://kottke.org/tag/media%20diet\">are available here</a>.</p>"
    },
    
{
      "title" : "Cars vs Giant Bulge and Other Outlandish Vehicular Simulations",
      "date_published" : "2022-05-06T16:52:16Z",
      "id" : "tag:kottke.org,2022://5.41139",
      "url" : "https://kottke.org/22/05/cars-vs-giant-bulge-and-other-outlandish-vehicular-simulations",
      "author" : {
         "name" : "Jason Kottke" 
      },
      "content_html" : "<p>It is Friday and this is the perfect Friday sort of post. <a href=\"https://www.beamng.com/game/\">BeamNG</a> is a video game of sorts that&#8217;s &#8220;a dynamic soft-body physics vehicle simulator capable of doing just about anything&#8221;. In the simulator, you can quickly devise all sorts of situations with a variety of cars and then press play to see what happens, with (mostly) realistic physics and collisions. For instance, here&#8217;s Cars vs Big Bulge:</p><p><iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/ZOm2JspqiHQ\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe></p><p>Chained Cars vs Bollards:</p><p><iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/rsc61lf3mCU\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe></p><p>Cars vs 100 Fallen Trees:</p><p><iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/TB-dTzQh9FM\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe></p><p>Trains vs Giant Pit:</p><p><iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/gaXkhN6aVxI\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe></p><p>And <a href=\"https://www.youtube.com/channel/UCP20blw_Bz9V7HFTvLlGiNQ/videos\">many many more</a>. My god if this simulator had been around when I was 12 years old, I might not have done anything else. Hell, if I downloaded and installed this right now, I might not ever get anything done ever again. (via <a href=\"https://twitter.com/tvaziri\">@tvaziri</a>)</p>"
    },
    
{
      "title" : "Letter of Recommendation: Get a Vasectomy",
      "date_published" : "2022-05-06T14:24:17Z",
      "id" : "tag:kottke.org,2022://5.41175",
      "url" : "https://kottke.org/22/05/letter-of-recommendation-get-a-vasectomy",
      "author" : {
         "name" : "Jason Kottke" 
      },
      "content_html" : "<p>Men in the US typically do not talk about or worry about birth control that much, to the detriment of the health and safety of women. In the spirit of trying to change that a little, I&#8217;m going to talk to you about my experience. About a decade ago, knowing that I did not want to have any more children, I had a vasectomy. And let me tell you, it&#8217;s been great. Quickly, here&#8217;s what a vasectomy is, <a href=\"https://www.mayoclinic.org/tests-procedures/vasectomy/about/pac-20384580\">via the Mayo Clinic</a>:</p><blockquote><p>Vasectomy is a form of male birth control that cuts the supply of sperm to your semen. It&#8217;s done by cutting and sealing the tubes that carry sperm. Vasectomy has a low risk of problems and can usually be performed in an outpatient setting under local anesthesia.</p></blockquote><p>Whether you&#8217;re in a committed relationship or a more casual one, knowing that you&#8217;re rolling up to sexual encounters with the birth control handled is a really good feeling for everyone concerned.<sup id=\"fnref:1651678719\"><a href=\"#fn:1651678719\" rel=\"footnote\">1</a></sup> Women have typically (and unfairly) had to be the responsible ones about birth control, in large part because it&#8217;s ultimately their body, health, and well-being that&#8217;s on the line if a sexual act results in pregnancy, but there are benefits of birth control that accrue to both parties (and to society) and taking over that important responsibility from your sexual partner is way more than equitable.</p><p>(Here&#8217;s the part where I need to come clean: getting a vasectomy was not my idea. I had to be talked into it. It seemed scary and birth control was not something I thought about as much as I should have. I&#8217;m ashamed of this; I wish I&#8217;d been more proactive and taken more responsibility about it. Guys, we should be talking about and thinking about this shit just as much as women do! I hope you&#8217;ve figured this out earlier than I did. Ok, back to the matter at hand.)</p><p>Vasectomies are often covered by health insurance and are (<a href=\"https://www.mayoclinic.org/tests-procedures/vasectomy-reversal/about/pac-20384537\">somewhat</a>) reversible. These issues can be legitimate dealbreakers for some people. Some folks cannot afford the cost of the procedure or can&#8217;t take the necessary time off of work to recover (heavy lifting is verboten for a few days afterwards). And if you get a vasectomy in your 20s for the purpose of 10-15 years of birth control before deciding to start a family, the lack of guarantee around reversal might be unappealing. Talk to your doctor, insurance company, and place of employment about these concerns!</p><p>Does the procedure hurt? This is a concern that many men have and the answer is yes: it hurts a little bit during and for a few days afterwards. For most people, you&#8217;re in and out in an hour or two, you ice your crotch, pop some Advil, take it easy for a few days, and you&#8217;re good to go.<sup id=\"fnref:1651839612\"><a href=\"#fn:1651839612\" rel=\"footnote\">1</a></sup> It&#8217;s a small price to pay and honestly if you don&#8217;t want to get a vasectomy because you&#8217;re worried about your balls aching for 48 hours, I&#8217;m going to suggest that you are a whiny little baby &#8212; and I&#8217;m telling you this as someone who is quite uncomfortable and <a href=\"https://kottke.org/17/03/that-fainting-life\">sometimes faints</a> during even routine medical procedures.</p><p>So, if you&#8217;re a sperm-producing person who has sex with people who can get pregnant and do not wish for pregnancy to occur, you should consider getting a vasectomy. It&#8217;s a minor procedure with few side effects that results in an almost iron-clad guarantee against unwanted pregnancy. At the very least, know that this is an option you have and that you can talk to your partner and doctor about it. Good luck!</p><ol><li class=\"footnote\" id=\"fn:1651678719\"><p>Just to be clear, you still have to worry about sexually transmitted infections &#8212; a vasectomy obviously does not provide any protection against that.<a href=\"#fnref:1651678719\" title=\"return to article\">&#x21A9;</a></p></li><p><li class=\"footnote\" id=\"fn:1651839612\"><p>There also is a follow-up about 6-12 weeks later to make sure the procedure worked. You masturbate into a cup and they check to see that there&#8217;s no sperm in the sample. Part of this follow-up, if my experience is any guide, includes checking that the doctor&#8217;s office bathroom door is locked about 50 times while watching very outdated porn on a small TV mounted up in the corner of the tiny room. It&#8217;s fine though! And you have a fun story to tell later.<a href=\"#fnref:1651839612\" title=\"return to article\">&#x21A9;</a></p></li></ol></p>"
    },
    
{
      "title" : "Extreme Pogo Stick Riding",
      "date_published" : "2022-05-05T20:43:20Z",
      "id" : "tag:kottke.org,2022://5.41163",
      "url" : "https://kottke.org/22/05/extreme-pogo-stick-riding",
      "author" : {
         "name" : "Jason Kottke" 
      },
      "content_html" : "<p>Inspired by <a href=\"https://twitter.com/justinboldaji/status/1507834204783988736\">this short video I found on Twitter</a> of people doing extreme stunts on pogo sticks, I found a few videos on YouTube that showcase what&#8217;s possible on what&#8217;s commonly thought of as an old-fashioned children&#8217;s toy.</p><p><iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/mmaC4NqWK_E\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe></p><p><iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/UL0roaC9PPw\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe></p><p><iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/swFhZyvjxik\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe></p><p>Gotta admire the spirit of humanity that turns absolutely everything into an extreme sport.</p>"
    },
    
{
      "title" : "Arctic Midnight Sun",
      "date_published" : "2022-05-05T18:39:56Z",
      "id" : "tag:kottke.org,2022://5.41164",
      "url" : "https://kottke.org/22/05/arctic-midnight-sun",
      "author" : {
         "name" : "Jason Kottke" 
      },
      "content_html" : "<p><iframe src=\"https://player.vimeo.com/video/126124468?h=99b1a8c9f8\" width=\"640\" height=\"360\" frameborder=\"0\" allow=\"autoplay; fullscreen; picture-in-picture\" allowfullscreen></iframe></p><p>This 360&deg; time lapse video, filmed by meteorologist Witek Kaszkin in 2015, follows the never-setting Sun in a 24-hour trip around the sky above the Arctic Circle as the icy Arctic landscape is bathed in constant summer sunlight.</p><p>See also &#8212; and I may be burying the lede here &#8212; <a href=\"https://vimeo.com/122795016\">Kaszkin&#8217;s video of a total solar eclipse</a> filmed from the same location. Wow. (via <a href=\"https://thekidshouldseethis.com/post/arctic-midnight-sun-24-hour-time-lapse\">the kid should see this</a>)</p>"
    },
    
{
      "title" : "Delia Derbyshire Demonstrates How Electronic Music Was Made at BBC Radiophonic Workshop",
      "date_published" : "2022-05-05T16:31:26Z",
      "id" : "tag:kottke.org,2022://5.41166",
      "url" : "https://kottke.org/22/05/delia-derbyshire-demonstrates-how-electronic-music-was-made-at-bbc-radiophonic-workshop",
      "author" : {
         "name" : "Jason Kottke" 
      },
      "content_html" : "<p><iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/qsRuhCflRyg\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe></p><p>In this video from 1965, electronic music pioneer Delia Derbyshire, who arranged the original theme music for Doctor Who, demonstrates how electronic music was made at the BBC Radiophonic Workshop. It&#8217;s such a treat watching her construct songs from electronic sound generators and sampled sounds played at different speeds and pitches; you can even see her layering sounds on different tape machines and beat matching, just like DJs would years later.</p><p>Amazingly, you can try your hand at layering and looping this music yourself with <a href=\"https://webaudio.prototyping.bbc.co.uk/tapeloops/#demo\">this Tape Loops demo</a> from the BBC. You can also make Dalek and Cybermen noises <a href=\"https://webaudio.prototyping.bbc.co.uk/ring-modulator/#demo\">with the Ring Modulator</a>, create <a href=\"https://webaudio.prototyping.bbc.co.uk/gunfire/#demo\">Gunfire Effects</a>, or use <a href=\"https://webaudio.prototyping.bbc.co.uk/wobbulator/#demo\">the Wobbulator</a> (my favorite).</p><p>See also <a href=\"https://www.dwtheme.com/\">The Definitive Guide to Doctor Who Theme Music</a>, <a href=\"https://www.youtube.com/watch?v=lNtZX02G-7w\">the trailer for Delia Derbyshire: The Myths and the Legendary Tapes</a>, and <a href=\"https://www.youtube.com/watch?v=vwQIgGQLOQ8\">this incredible proto-techno track Derbyshire made in the 60s</a>. (via <a href=\"https://twitter.com/austinkleon\">@austinkleon</a>)</p>"
    },
    
{
      "title" : "Noto: A Typeface for the World",
      "date_published" : "2022-05-05T14:28:46Z",
      "id" : "tag:kottke.org,2022://5.41159",
      "url" : "https://kottke.org/22/05/noto-a-typeface-for-the-world",
      "author" : {
         "name" : "Jason Kottke" 
      },
      "content_html" : "<p><img src=\"/plus/misc/images/noto.jpg\" width=\"1000\" height=\"894\" border=\"0\" alt=\"character sample from the Noto typeface\" /></p><p>Google has developed <a href=\"https://fonts.google.com/noto\">a typeface called Noto</a> that seemingly includes every single character and symbol used for writing in the history of the world. I mean, look at <a href=\"https://fonts.google.com/noto/fonts\">all these different options</a>: Korean, Bengali, Emoji, Egyptian hieroglyphs, Coptic, Old Hungarian, Cuneiform, Linear B, Osage, and literally dozens more.</p><blockquote><p>Noto is a collection of high-quality fonts with multiple weights and widths in sans, serif, mono, and other styles. The Noto fonts are perfect for harmonious, aesthetic, and typographically correct global communication, in more than 1,000 languages and over 150 writing systems.</p></blockquote><p>A particular shoutout to <a href=\"https://fonts.google.com/noto/specimen/Noto+Emoji\">Noto Emoji</a>: it supports the latest emoji release (14.0) and includes 3,663 emoji in multiple weights.</p><p><img src=\"/plus/misc/images/noto-emoji.jpg\" width=\"1000\" height=\"313\" border=\"0\" alt=\"Noto Emoji\" /></p><p>Perhaps it&#8217;s time for a new typeface &#8216;round these parts&#8230;</p><p><strong title=\"May 05, 2022\">Update:</strong> I got it in my head that Noto was a new typeface, but it was <a href=\"https://en.wikipedia.org/wiki/Noto_fonts\">first released in 2013</a>. But Noto&#8217;s monochrome emoji font <a href=\"https://developers.googleblog.com/2022/04/what-is-black-and-white-and-read-all.html\"><em>is</em> new</a> &#8212; I think that&#8217;s where I got confused.</p>"
    },
    
{
      "title" : "Trailer for Obi-Wan Kenobi",
      "date_published" : "2022-05-05T00:00:01Z",
      "id" : "tag:kottke.org,2022://5.41149",
      "url" : "https://kottke.org/22/05/trailer-for-obi-wan-kenobi",
      "author" : {
         "name" : "Jason Kottke" 
      },
      "content_html" : "<p><iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/3Yh_6_zItPU\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe></p><p>May the 4th be with you and here&#8217;s the trailer for the upcoming Disney+ series, Obi-Wan Kenobi.</p><blockquote><p>The story begins 10 years after the dramatic events of &#8220;Star Wars: Revenge of the Sith&#8221; where Obi-Wan Kenobi faced his greatest defeat &#8212; the downfall and corruption of his best friend and Jedi apprentice, Anakin Skywalker, who turned to the dark side as evil Sith Lord Darth Vader.</p></blockquote>"
    },
    
{
      "title" : "Abortion Protects the Lives of Women",
      "date_published" : "2022-05-04T16:25:37Z",
      "id" : "tag:kottke.org,2022://5.41151",
      "url" : "https://kottke.org/22/05/abortion-protects-the-lives-of-women",
      "author" : {
         "name" : "Jason Kottke" 
      },
      "content_html" : "<p>Dr. Dipti S. Barot writing for HuffPost, <a href=\"https://www.huffpost.com/entry/abortion-11-year-old-pregnant_n_6266e555e4b07c34e9e4cb27\">My 11-Year-Old Patient Was Pregnant. Here&#8217;s What I Want You To Know About Being &#8216;Pro-Life.&#8217;</a> (Content warning: rape.)</p><blockquote><p>Sophia is in her 20s now. I wonder how she has healed, how she has processed that trauma. Did she get to go to college? Has she been able to trust an intimate partner? Has she been pregnant on her own terms at the time of her choosing? Does she have a child? I can see her wide face and her soft smile in my mind&#8217;s eye and I know now, just as I knew then, that the decision to terminate Sophia&#8217;s pregnancy, supported by the ones who loved her the most, was a pro-life decision.</p></blockquote><p>And:</p><blockquote><p>I remember how tiny that clinic room felt. There was no room for politicians signing evil bills flanked by child props as old as Sophia, no room for Supreme Court justices who claim to value life while wondering aloud how pregnancy can be an undue burden. No room for those extraneous, unnecessary, useless others in that most intimate of spaces. Our clinic rooms will always be too small for anybody but providers and our patients.</p></blockquote>"
    },
    
{
      "title" : "The Real Fight for Abortion Rights",
      "date_published" : "2022-05-04T15:22:40Z",
      "id" : "tag:kottke.org,2022://5.41148",
      "url" : "https://kottke.org/22/05/the-real-fight-for-abortion-rights",
      "author" : {
         "name" : "Jason Kottke" 
      },
      "content_html" : "<p><a href=\"https://newrepublic.com/article/166286/abortion-rights-roe-wade-alito-supreme-court\">Melissa Gira Grant writing in The New Republic</a> with a reminder that activists have seen this coming for a long time and moderates did not heed the warning:</p><blockquote><p>Reproductive justice advocates have long warned that Roe v. Wade was in danger, well before the court agreed to take this case concerning a Mississippi abortion ban &#8212; before Justice Ruth Bader Ginsburg&#8217;s death, before Trump shifted the balance of the court by appointing justices certain to roll back Roe.</p><p>Those who saw this coming, who never believed the court could save them, who have mostly given up on the Democratic Party&#8217;s promises to protect Roe, have hardly been quiet or thwarted. Every local abortion fund launched to bridge the divide between a right and acting on it, every shared how-to on self-managed abortion using misoprostol pills (and mifepristone, if you can get it) &#8212; that&#8217;s what knowing this moment would come has looked like for years. It&#8217;s what surviving the end of Roe has already meant in the 89 percent of counties in this country without a clinic providing abortion, where abortion is already a contingent right.</p></blockquote><p>(via <a href=\"https://waxy.org/\">waxy</a>)</p>"
    },
    
{
      "title" : "Into the Dark Ages",
      "date_published" : "2022-05-04T14:40:53Z",
      "id" : "tag:kottke.org,2022://5.41146",
      "url" : "https://kottke.org/22/05/into-the-dark-ages",
      "author" : {
         "name" : "Jason Kottke" 
      },
      "content_html" : "<p>Speaking of the fundamentalist movement to <a href=\"https://kottke.org/22/05/the-plan-to-repeal-the-20th-century\">repeal the 20th century</a>, Jack Mirkinson isn&#8217;t writing for The Atlantic and therefore <a href=\"https://www.discourseblog.com/p/god-damn-america\">is free to not mince words</a>:</p><blockquote><p>[Alito] says that Roe should be scrapped because the right to an abortion is &#8220;not deeply rooted in the Nation&#8217;s history and traditions&#8221; &#8212; a byzantine litmus test that would wipe out just about every modern civil rights protection you can think of, given the nature of American history. He forthrightly casts aside the notion that the court should be cautious about overturning decades of precedent. He sends unmistakable signals that other civil rights opinions, especially ones protecting gay rights, are in the crosshairs.</p><p>The final opinion could differ, but what we have in front of us is an extremist, illegitimate opinion from an extremist, illegitimate court, one that sees women as serfs and breeders, that sees queer people as subhuman, that sees minorities of every kind as dirt under its collective shoe. It is happily dragging us into the dark ages. Alito and everyone who joins him are evil people. No hell is too hot for them.</p></blockquote><p>(via <a href=\"https://waxy.org/\">waxy</a>)</p>"
    },
    
{
      "title" : "The Plan to Repeal the 20th Century",
      "date_published" : "2022-05-04T13:39:13Z",
      "id" : "tag:kottke.org,2022://5.41145",
      "url" : "https://kottke.org/22/05/the-plan-to-repeal-the-20th-century",
      "author" : {
         "name" : "Jason Kottke" 
      },
      "content_html" : "<p><a href=\"https://www.theatlantic.com/ideas/archive/2022/05/alito-leaked-roe-opinion-abortion-supreme-court-civil-rights/629748/\">Adam Serwer writing in The Atlantic</a> about the leaked Supreme Court opinion draft penned by conservative justice Samuel Alito that will, if it remains substantially unmodified, overturn Roe v Wade and other precedents that guarantee the right to an abortion in the United States.</p><blockquote><p>&#8220;The majority can believe that it&#8217;s only eviscerating a right to abortion in this draft,&#8221; Stephen Vladeck, a law professor at the University of Texas at Austin, told me, &#8220;but the means by which it does so would open the door to similar attacks on other unenumerated rights, both directly, by attacking the underpinnings of those doctrines, and indirectly, by setting a precedent for such an attack.&#8221;</p><p>Aside from rights specifically mentioned in the text of the Constitution, Alito argues, only those rights &#8220;deeply rooted in the nation&#8217;s history in tradition&#8221; deserve its protections. This is as arbitrary as it is lawless. Alito is saying there is no freedom from state coercion that conservatives cannot strip away if conservatives find that freedom personally distasteful. The rights of heterosexual married couples to obtain contraception, or of LGBTQ people to be free from discrimination, are obvious targets. But other rights that Americans now take for granted could easily be excluded by this capricious reasoning.</p><p>&#8220;In a series of cases beginning in the early 1920s, the Court carved out a protected space for family, marriage, and children that the government is constrained from regulating,&#8221; <a href=\"https://www.theatlantic.com/ideas/archive/2021/12/what-roe-could-take-down-it/620892/\">Kimberly Wehle wrote last December</a>. &#8220;A rollback of Roe could split this sphere open if the conservative theory that implied rights are constitutionally invalid takes hold, and states begin passing draconian laws that creep into other areas of intimate personal life.&#8221;</p></blockquote><p>And:</p><blockquote><p>On the grounds that it constitutes a form of religious discrimination, conservatives will be able to claim an exemption from any generally applicable rule they do not wish to follow, while imposing their own religious and ideological views on those who do not share them. Although the right-wing justices present this rule in the language of constitutionalism, they are simply imposing their ideological and cultural preferences on the rest of the country.</p></blockquote><p>Abortion, same-sex marriage, birth control, rights for trans persons, other LGBTQ protections, other civil rights &#8212; it&#8217;s all <a href=\"https://www.reuters.com/world/us/gay-marriage-other-rights-risk-after-us-supreme-court-abortion-move-2022-05-04/\">on the table</a>, they&#8217;re coming for all of it.</p><p><strong title=\"May 04, 2022\">Update:</strong> See also <a href=\"https://roberthubbell.substack.com/p/this-is-just-the-beginning\">This is just the beginning</a>:</p><blockquote><p>I ask you to re-read the above passage and substitute for the word &#8220;abortion&#8221; any other modern liberty not mentioned in the Constitution: the right to use contraception, same-sex marriage, the right of same-sex couples to adopt children, marriage between different &#8220;races,&#8221; the right of any consenting adults to engage in sex, the right of unmarried couples to live together, and the rights of LGBTQ people to be treated with equal dignity.</p><p>Each of the above rights &#8212; now widely accepted &#8212; was criminalized or prohibited in many U.S. states until the latter part of the 20th century. Under Justice Alito&#8217;s reasoning, because the Constitution &#8220;makes no reference to those rights&#8221; and they were &#8220;unknown&#8221; in American jurisprudence until recently, the Constitution affords them no protection. Alito does handsprings to claim the draft ruling does not reach other rights rooted in the same legal ground as Roe and Casey. But there is no difference under Alito&#8217;s reasoning between abortion and contraception, same sex marriage, same-sex adoption, and bans against &#8220;fornication,&#8221; &#8220;sodomy,&#8221; cohabitation, and &#8220;miscegenation.&#8221;</p><p>This is just the beginning.</p></blockquote>"
    },
    
{
      "title" : "Weird: The Al Yankovic Story",
      "date_published" : "2022-05-03T20:33:18Z",
      "id" : "tag:kottke.org,2022://5.41140",
      "url" : "https://kottke.org/22/05/weird-the-al-yankovic-story",
      "author" : {
         "name" : "Jason Kottke" 
      },
      "content_html" : "<p><iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/MVXGgwhO6jc\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe></p><p>You have to admire Daniel Radcliffe for his movie & theater role choices since Harry Potter. He&#8217;s done Swiss Army Man, Equus on Broadway, all sorts of small & independent films, several on- and off-Broadway plays, and now he&#8217;s starring as Al in a Weird Al Yankovic biopic. And&#8230;&#8230;it works? <a href=\"https://variety.com/2022/digital/news/daniel-radcliffe-weird-al-yankovic-roku-trailer-1235257209/\">Variety</a> calls it a &#8220;scripted mockumentary&#8221;. I&#8217;ll watch.</p>"
    },
    
{
      "title" : "The Brain Eating Amoeba, the Most Overhyped Monster on Earth",
      "date_published" : "2022-05-03T18:30:11Z",
      "id" : "tag:kottke.org,2022://5.41138",
      "url" : "https://kottke.org/22/05/the-brain-eating-amoeba-the-most-overhyped-monster-on-earth",
      "author" : {
         "name" : "Jason Kottke" 
      },
      "content_html" : "<p><iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/7OPg-ksxZ4Y\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe></p><p>In retrospect, maybe today wasn&#8217;t such a good day to watch a video about how incredibly scary brain-eating amoebas are. But, as you might guess from the title, we don&#8217;t actually need to worry too much about them.</p><blockquote><p>While the Naegleria fowleri is clearly extremely deadly and the infection truly horrible, there have only been a few hundred cases in the last few decades. You are way more likely to drown in a pool than to get infected.</p></blockquote><p>A reminder that in our current media environment, calibrating personal risk can be challenging.</p>"
    },
    
{
      "title" : "The Invention of Coca-Cola, Miracle Brain Tonic",
      "date_published" : "2022-05-03T16:06:33Z",
      "id" : "tag:kottke.org,2022://5.41135",
      "url" : "https://kottke.org/22/05/the-invention-of-coca-cola-miracle-brain-tonic",
      "author" : {
         "name" : "Jason Kottke" 
      },
      "content_html" : "<p><iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/BZ7mcB2Ud2U\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe></p><p>Spurred by a near death experience in the Civil War (after sustaining a saber wound to the chest) and looking for a way to manage the resultant addiction to morphine, pharmacist Dr. John Pemberton invented the drink that would become the globally famous and lucrative fizzy drink, Coca-Cola. I&#8217;d heard bits and pieces of this story over the year &#8212; it&#8217;s part of America&#8217;s consumerist mythology and therefore hard to ignore completely &#8212; but had never really had the whole thing explained to me. (via <a href=\"https://www.openculture.com/2022/04/coca-cola-made-with-cocaine-was-originally-sold-as-an-intellectual-stimulant-medicine.html\">open culture</a>)</p>"
    },
    
{
      "title" : "How Postwar Italy Created The Paparazzi",
      "date_published" : "2022-05-03T14:00:18Z",
      "id" : "tag:kottke.org,2022://5.41133",
      "url" : "https://kottke.org/22/05/how-postwar-italy-created-the-paparazzi",
      "author" : {
         "name" : "Jason Kottke" 
      },
      "content_html" : "<p><iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/-H1c7C-hyAk\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe></p><p>From film fan Benito Mussolini and the postwar explosion of Italian filmmaking to a financial rule with big effects and Federico Fellini&#8217;s La Dolce Vita, Evan Puschak tells the story of how the paparazzi was created.</p><blockquote><p>The history of celebrity paparazzi disrupted the highly manicured image movie stars had enjoyed since the golden age of Hollywood. They brought these gods of our culture down to the messy earth. Interestingly though, this didn&#8217;t dampen our obsession with fame, as you might expect. No, it turbo charged it. Something about seeing our celebrities brought low &#8212; catching a glimpse of their flaws and pains &#8212; it didn&#8217;t push the famous off these weird pedestals we put them on. It only intensified our fixation with them.</p></blockquote>"
    },
    
{
      "title" : "Natasha Lyonne Revisits Her Breakout Characters",
      "date_published" : "2022-05-02T20:02:15Z",
      "id" : "tag:kottke.org,2022://5.41127",
      "url" : "https://kottke.org/22/05/natasha-lyonne-revisits-her-breakout-characters",
      "author" : {
         "name" : "Jason Kottke" 
      },
      "content_html" : "<p>Today I discovered that all I want to do is listen to Natasha Lyonne talk about her experiences in showbiz. But instead I got a little more than 7 minutes and that&#8217;s just fine:</p><p><iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/gKitmXlMotg\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe></p><p>I&#8217;m a few episodes into the second season of <a href=\"https://www.netflix.com/title/80211627\">Russian Doll</a> right now and it&#8217;s so good.</p>"
    },
    
{
      "title" : "Turn Every Page: A Documentary on Robert Caro and Robert Gottlieb",
      "date_published" : "2022-05-02T18:02:26Z",
      "id" : "tag:kottke.org,2022://5.41126",
      "url" : "https://kottke.org/22/05/turn-every-page-a-documentary-on-robert-caro-and-robert-gottlieb",
      "author" : {
         "name" : "Jason Kottke" 
      },
      "content_html" : "<p>This looks interesting: <a href=\"https://www.caroandgottliebmovie.com\">a feature-length documentary on the life and work of Robert Caro and his longtime editor Robert Gottlieb</a>, directed by Gottlieb&#8217;s daughter Lizzie Gottlieb.</p><blockquote><p>Pulitzer Prize winning writer Robert Caro and legendary editor Robert Gottlieb have been working - and fighting -  together for 50 years. At 86, Caro is battling time to finish work on his long-promised fifth and final volume of The Years of Lyndon Johnson. Now 90, Gottlieb continues to edit, write and pursue his myriad and unexpected passions, attempting  to &#8220;love and be silent&#8221; until he and Caro can begin to edit Caro&#8217;s final masterwork.</p><p>Directed by Gottlieb&#8217;s daughter Lizzie Gottlieb, Turn Every Page is an intimate look into artistry, mortality, antagonism, and friendship. Gottlieb chronicles the behind-the-scenes drama of the making of Caro&#8217;s The Power Broker and The Years of Lyndon B. Johnson volumes. The film is a deep-dive into the power dynamics of creative collaboration, the peculiarities and work habits of two ferocious intellects, and the culmination of a journey that has consumed both of their lives.</p></blockquote><p>No trailer and no release date that I can find, but I will absolutely see this whenever it comes out. See also the New-York Historical Society&#8217;s ongoing exhibition, <a href=\"https://www.nyhistory.org/exhibitions/turn-every-page-inside-robert-caro-archive\">&#8220;Turn Every Page&#8221;: Inside the Robert A. Caro Archive</a>.</p>"
    },
    
{
      "title" : "Logos You Can See From Space",
      "date_published" : "2022-05-02T16:00:43Z",
      "id" : "tag:kottke.org,2022://5.41124",
      "url" : "https://kottke.org/22/05/logos-you-can-see-from-space",
      "author" : {
         "name" : "Jason Kottke" 
      },
      "content_html" : "<p><img src=\"/plus/misc/images/logos-from-space-01.jpg\" width=\"1000\" height=\"613\" border=\"0\" alt=\"satellite image of a solar array in the shape of Mickey Mouse\" /></p><p><img src=\"/plus/misc/images/logos-from-space-02.jpg\" width=\"1000\" height=\"704\" border=\"0\" alt=\"satellite image of SpaceX headquarters with an X on the roof\" /></p><p><img src=\"/plus/misc/images/logos-from-space-03.jpg\" width=\"1000\" height=\"557\" border=\"0\" alt=\"satellite image of a Target store with a Target logo on the roof\" /></p><p><img src=\"/plus/misc/images/logos-from-space-04.jpg\" width=\"1000\" height=\"623\" border=\"0\" alt=\"satellite image of the BMW Museum with a BMW logo on the roof\" /></p><p><img src=\"/plus/misc/images/logos-from-space-05.jpg\" width=\"1000\" height=\"632\" border=\"0\" alt=\"satellite image of a huge Coca-Cola logo in the Chilean desert\" /></p><p>Elissaveta M. Brandon recently wrote about the uptick in companies placing huge logos, often drawn in solar panels, <a href=\"https://www.fastcompany.com/90745955/the-next-frontier-in-branding-logos-you-can-see-from-space\">so that they can be seen in satellite imagery</a>. I collected images of a few examples of logos that are viewable from space above: a solar array at Walt Disney World, an X on the roof of the SpaceX HQ, a Target logo on top of a Target store, the BMW Museum, and <a href=\"https://www.atlasobscura.com/places/worlds-largest-coca-cola-logo\">a huge Coca-Cola logo</a> that&#8217;s been in the Chilean desert since 1986 (and is therefore difficult to see on satellite imagery). (via <a href=\"https://clivethompson.medium.com/a-steampunk-mouse-marsquakes-and-ai-tells-me-im-an-asshole-d5d7d206fd8f\">clive thompson</a>)</p>"
    }
  ]
}



